[NoCoverage] BlockStatement
src/api/controllers/permissions.controller.ts:27:75
   ) {}
 
   @Post('/create')
-  async createPermission(@Body() body: CreatePermissionDTO): Promise<any> {
-    const { permissionName } = body;
-
-    const command = new CreatePermissionCommand(permissionName);
-    return await this.commandBus.execute(command);
-  }
+  async createPermission(@Body() body: CreatePermissionDTO): Promise<any> {}
 
   @Get('/')

[NoCoverage] BlockStatement
src/api/controllers/permissions.controller.ts:35:43
   }
 
   @Get('/')
-  async getAllPermissions(): Promise<any> {
-    const query = new GetAllPermissionsQuery();
-
-    return await this.queryBus.execute(query);
-  }
+  async getAllPermissions(): Promise<any> {}
 
   @Get('/:id')

[NoCoverage] BlockStatement
src/api/controllers/permissions.controller.ts:42:71
   }
 
   @Get('/:id')
-  async listSpecificPermission(@Param('id') id: string): Promise<any> {
-    const query = new ListSpecificPermissionQuery(id);
-
-    return await this.queryBus.execute(query);
-  }
+  async listSpecificPermission(@Param('id') id: string): Promise<any> {}
 
   @Delete('delete/:id')

[NoCoverage] BlockStatement
src/api/controllers/permissions.controller.ts:49:65
   }
 
   @Delete('delete/:id')
-  async deletePermission(@Param('id') id: string): Promise<any> {
-    const command = new DeletePermissionCommand(id);
-
-    return await this.commandBus.execute(command);
-  }
+  async deletePermission(@Param('id') id: string): Promise<any> {}
 
   @Patch('/:id')

[NoCoverage] BlockStatement
src/api/controllers/permissions.controller.ts:59:19
   async updatePermission(
     @Param('id') id: string,
     @Body() body: UpdatePermissionDTO,
-  ): Promise<any> {
-    const { permissionName } = body;
-    const command = new UpdatePermissionCommand(id, permissionName);
-    return await this.commandBus.execute(command);
-  }
+  ): Promise<any> {}
 }
 
