[NoCoverage] BlockStatement
src/api/controllers/address.controller.ts:27:66
   ) {}
 
   @Post('/create')
-  async createUser(@Body() body: CreateAddressDTO): Promise<any> {
-    const { cep, country, state, city, district, street, number, complement } =
-      body;
-
-    const command = new CreateAddressCommand(
-      cep,
-      country,
-      state,
-      city,
-      district,
-      street,
-      number,
-      complement,
-    );
-    return await this.commandBus.execute(command);
-  }
+  async createUser(@Body() body: CreateAddressDTO): Promise<any> {}
 
   @Get('/')

[NoCoverage] BlockStatement
src/api/controllers/address.controller.ts:45:39
   }
 
   @Get('/')
-  async getAllAddress(): Promise<any> {
-    const query = new GetAllAddressQuery();
-
-    return await this.queryBus.execute(query);
-  }
+  async getAllAddress(): Promise<any> {}
 
   @Get('/:id')

[NoCoverage] BlockStatement
src/api/controllers/address.controller.ts:52:68
   }
 
   @Get('/:id')
-  async listSpecificAddress(@Param('id') id: string): Promise<any> {
-    const query = new ListSpecificAddressQuery(id);
-    return await this.queryBus.execute(query);
-  }
+  async listSpecificAddress(@Param('id') id: string): Promise<any> {}
 
   @Delete('delete/:id')

[NoCoverage] BlockStatement
src/api/controllers/address.controller.ts:58:62
   }
 
   @Delete('delete/:id')
-  async deleteAddress(@Param('id') id: string): Promise<any> {
-    const command = new DeleteAddressCommand(id);
-
-    return await this.commandBus.execute(command);
-  }
+  async deleteAddress(@Param('id') id: string): Promise<any> {}
 
   @Patch('/:id')

[NoCoverage] BlockStatement
src/api/controllers/address.controller.ts:68:19
   async updateAddress(
     @Param('id') id: string,
     @Body() body: UpdateAddressDTO,
-  ): Promise<any> {
-    const { cep, country, state, city, district, street, number, complement } =
-      body;
-    const command = new UpdateAddressCommand(
-      id,
-      cep,
-      country,
-      state,
-      city,
-      district,
-      street,
-      number,
-      complement,
-    );
-    return await this.commandBus.execute(command);
-  }
+  ): Promise<any> {}
 }
 
