[NoCoverage] BlockStatement
src/api/controllers/doctor.controller.ts:27:67
   ) {}
 
   @Post('/create')
-  async createDoctor(@Body() body: CreateDoctorDTO): Promise<any> {
-    const { userId, crm, specialization, shift } = body;
-
-    const command = new CreateDoctorCommand(userId, crm, specialization, shift);
-
-    return await this.commandBus.execute(command);
-  }
+  async createDoctor(@Body() body: CreateDoctorDTO): Promise<any> {}
 
   @Get('/')

[NoCoverage] BlockStatement
src/api/controllers/doctor.controller.ts:36:39
   }
 
   @Get('/')
-  async getAllDoctors(): Promise<any> {
-    const query = new GetAllDoctorsQuery();
-    return await this.queryBus.execute(query);
-  }
+  async getAllDoctors(): Promise<any> {}
 
   @Get('/:id')

[NoCoverage] BlockStatement
src/api/controllers/doctor.controller.ts:42:67
   }
 
   @Get('/:id')
-  async listSpecificDoctor(@Param('id') id: string): Promise<any> {
-    const query = new ListSpecificDoctorQuery(id);
-    return await this.queryBus.execute(query);
-  }
+  async listSpecificDoctor(@Param('id') id: string): Promise<any> {}
 
   @Delete('delete/:id')

[NoCoverage] BlockStatement
src/api/controllers/doctor.controller.ts:48:61
   }
 
   @Delete('delete/:id')
-  async deleteDoctor(@Param('id') id: string): Promise<any> {
-    const command = new DeleteDoctorCommand(id);
-    return await this.commandBus.execute(command);
-  }
+  async deleteDoctor(@Param('id') id: string): Promise<any> {}
 
   @Patch('update/:id')

[NoCoverage] BlockStatement
src/api/controllers/doctor.controller.ts:57:19
   async updateDoctor(
     @Param('id') id: string,
     @Body() body: UpdateDoctorDTO,
-  ): Promise<any> {
-    const { crm, specialization, shift } = body;
-    const command = new UpdateDoctorCommand(id, crm, specialization, shift);
-    return await this.commandBus.execute(command);
-  }
+  ): Promise<any> {}
 }
 
