[NoCoverage] MethodExpression
application/handlers/permissions/createPermissions.handler.ts:21:29
     try {
       const { permissionName } = command;
 
-      const formattedName = permissionName.toUpperCase();
+      const formattedName = permissionName.toLowerCase();
 
       const existingPermission = await this.permissionRepository.findOne({

[NoCoverage] BlockStatement
application/handlers/permissions/createPermissions.handler.ts:27:31
         where: [{ permissionName: formattedName }],
       });
 
-      if (existingPermission) {
-        throw new BadRequestException(
-          'Nome da permissão já em uso. Por favor, tente novamente com outros dados.',
-        );
-      }
+      if (existingPermission) {}
 
       const permission = this.permissionRepository.create({

[NoCoverage] ConditionalExpression
application/handlers/permissions/createPermissions.handler.ts:27:11
         where: [{ permissionName: formattedName }],
       });
 
-      if (existingPermission) {
+      if (false) {
         throw new BadRequestException(
           'Nome da permissão já em uso. Por favor, tente novamente com outros dados.',

[NoCoverage] ObjectLiteral
application/handlers/permissions/createPermissions.handler.ts:33:59
         );
       }
 
-      const permission = this.permissionRepository.create({
-        permissionName: formattedName,
-      });
+      const permission = this.permissionRepository.create({});
 
       await this.permissionRepository.save(permission);

[NoCoverage] BlockStatement
application/handlers/permissions/createPermissions.handler.ts:45:21
           permissionName: permission.permissionName,
         },
       };
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao criar permissão. Por favor, tente novamente.',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] ConditionalExpression
application/handlers/permissions/createPermissions.handler.ts:47:9
       };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao criar permissão. Por favor, tente novamente.',
+        true,
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/permissions/createPermissions.handler.ts:47:9
       };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao criar permissão. Por favor, tente novamente.',
+        false,
       );
     }
