[NoCoverage] BlockStatement
src/api/controllers/nurse.controller.ts:27:65
   ) {}
 
   @Post('/create')
-  async createNurse(@Body() body: CreateNurseDTO): Promise<any> {
-    const { userId, coren, specialization, shift } = body;
-
-    const command = new CreateNurseCommand(
-      userId,
-      coren,
-      specialization,
-      shift,
-    );
-
-    return await this.commandBus.execute(command);
-  }
+  async createNurse(@Body() body: CreateNurseDTO): Promise<any> {}
 
   @Get('/')

[NoCoverage] BlockStatement
src/api/controllers/nurse.controller.ts:41:38
   }
 
   @Get('/')
-  async getAllNurses(): Promise<any> {
-    const query = new GetAllNursesQuery();
-    return await this.queryBus.execute(query);
-  }
+  async getAllNurses(): Promise<any> {}
 
   @Get('/:id')

[NoCoverage] BlockStatement
src/api/controllers/nurse.controller.ts:47:66
   }
 
   @Get('/:id')
-  async listSpecificNurse(@Param('id') id: string): Promise<any> {
-    const query = new ListSpecificNurseQuery(id);
-    return await this.queryBus.execute(query);
-  }
+  async listSpecificNurse(@Param('id') id: string): Promise<any> {}
 
   @Delete('delete/:id')

[NoCoverage] BlockStatement
src/api/controllers/nurse.controller.ts:53:60
   }
 
   @Delete('delete/:id')
-  async deleteNurse(@Param('id') id: string): Promise<any> {
-    const command = new DeleteNurseCommand(id);
-    return await this.commandBus.execute(command);
-  }
+  async deleteNurse(@Param('id') id: string): Promise<any> {}
 
   @Patch('update/:id')

[NoCoverage] BlockStatement
src/api/controllers/nurse.controller.ts:62:19
   async updateNurse(
     @Param('id') id: string,
     @Body() body: UpdateNurseDTO,
-  ): Promise<any> {
-    const { coren, specialization, shift } = body;
-    const command = new UpdateNurseCommand(id, coren, specialization, shift);
-    return await this.commandBus.execute(command);
-  }
+  ): Promise<any> {}
 }
 
