[NoCoverage] BlockStatement
application/handlers/permissions/deletePermission.handler.ts:24:47
 
   async execute(
     command: DeletePermissionCommand,
-  ): Promise<{ message: string; id: string }> {
-    const { id } = command;
-
-    const permission = await this.permissionRepository.findOneBy({ id });
-
-    if (!permission) {
-      throw new NotFoundException('Permissão não encontrada');
-    }
-
-    try {
-      await this.permissionRepository.delete(id);
-      return { message: 'Permissão deletada com sucesso', id };
-    } catch (error) {
-      console.error(
-        'Erro inesperado ao tentar deletar a permissão no banco:',
-        error,
-      );
-      throw new InternalServerErrorException(
-        `Ocorreu um erro no servidor ao tentar deletar a permissão. Detalhe: ${error.message}`,
-      );
-    }
-  }
+  ): Promise<{ message: string; id: string }> {}
 }
 

[NoCoverage] ObjectLiteral
application/handlers/permissions/deletePermission.handler.ts:27:66
   ): Promise<{ message: string; id: string }> {
     const { id } = command;
 
-    const permission = await this.permissionRepository.findOneBy({ id });
+    const permission = await this.permissionRepository.findOneBy({});
 
     if (!permission) {

[NoCoverage] ConditionalExpression
application/handlers/permissions/deletePermission.handler.ts:29:9
 
     const permission = await this.permissionRepository.findOneBy({ id });
 
-    if (!permission) {
+    if (true) {
       throw new NotFoundException('Permissão não encontrada');
     }

[NoCoverage] ConditionalExpression
application/handlers/permissions/deletePermission.handler.ts:29:9
 
     const permission = await this.permissionRepository.findOneBy({ id });
 
-    if (!permission) {
+    if (false) {
       throw new NotFoundException('Permissão não encontrada');
     }

[NoCoverage] BlockStatement
application/handlers/permissions/deletePermission.handler.ts:33:9
       throw new NotFoundException('Permissão não encontrada');
     }
 
-    try {
-      await this.permissionRepository.delete(id);
-      return { message: 'Permissão deletada com sucesso', id };
-    } catch (error) {
+    try {} catch (error) {
       console.error(
         'Erro inesperado ao tentar deletar a permissão no banco:',

[NoCoverage] ObjectLiteral
application/handlers/permissions/deletePermission.handler.ts:35:14
 
     try {
       await this.permissionRepository.delete(id);
-      return { message: 'Permissão deletada com sucesso', id };
+      return {};
     } catch (error) {
       console.error(

[NoCoverage] StringLiteral
application/handlers/permissions/deletePermission.handler.ts:35:25
 
     try {
       await this.permissionRepository.delete(id);
-      return { message: 'Permissão deletada com sucesso', id };
+      return { message: "", id };
     } catch (error) {
       console.error(

[NoCoverage] BlockStatement
application/handlers/permissions/deletePermission.handler.ts:36:21
     try {
       await this.permissionRepository.delete(id);
       return { message: 'Permissão deletada com sucesso', id };
-    } catch (error) {
-      console.error(
-        'Erro inesperado ao tentar deletar a permissão no banco:',
-        error,
-      );
-      throw new InternalServerErrorException(
-        `Ocorreu um erro no servidor ao tentar deletar a permissão. Detalhe: ${error.message}`,
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] StringLiteral
application/handlers/permissions/deletePermission.handler.ts:42:9
         error,
       );
       throw new InternalServerErrorException(
-        `Ocorreu um erro no servidor ao tentar deletar a permissão. Detalhe: ${error.message}`,
+        ``,
       );
     }
