[NoCoverage] BlockStatement
src/api/controllers/role.controller.ts:27:63
   ) {}
 
   @Post('/create')
-  async createRole(@Body() body: CreateRoleDTO): Promise<any> {
-    const { name } = body;
-
-    const command = new CreateRoleCommand(name);
-    return await this.commandBus.execute(command);
-  }
+  async createRole(@Body() body: CreateRoleDTO): Promise<any> {}
 
   @Get('/')

[NoCoverage] BlockStatement
src/api/controllers/role.controller.ts:35:37
   }
 
   @Get('/')
-  async getAllRoles(): Promise<any> {
-    const query = new GetAllRolesQuery();
-
-    return await this.queryBus.execute(query);
-  }
+  async getAllRoles(): Promise<any> {}
 
   @Get('/:id')

[NoCoverage] BlockStatement
src/api/controllers/role.controller.ts:42:65
   }
 
   @Get('/:id')
-  async listSpecificUser(@Param('id') id: string): Promise<any> {
-    const query = new ListSpecificRoleQuery(id);
-
-    return await this.queryBus.execute(query);
-  }
+  async listSpecificUser(@Param('id') id: string): Promise<any> {}
 
   @Delete('delete/:id')

[NoCoverage] BlockStatement
src/api/controllers/role.controller.ts:49:59
   }
 
   @Delete('delete/:id')
-  async deleteRole(@Param('id') id: string): Promise<any> {
-    const command = new DeleteRoleCommand(id);
-
-    return await this.commandBus.execute(command);
-  }
+  async deleteRole(@Param('id') id: string): Promise<any> {}
 
   @Patch('/:id')

[NoCoverage] BlockStatement
src/api/controllers/role.controller.ts:59:19
   async updateRole(
     @Param('id') id: string,
     @Body() body: UpdateRoleDTO,
-  ): Promise<any> {
-    const { name } = body;
-    const command = new UpdateRoleCommand(id, name);
-    return await this.commandBus.execute(command);
-  }
+  ): Promise<any> {}
 }
 
