[NoCoverage] BlockStatement
application/handlers/permissions/getAllPermissions.handler.ts:17:42
     private readonly permissionRepository: Repository<Permission>,
   ) {}
 
-  async execute(): Promise<Permission[]> {
-    try {
-      return await this.permissionRepository.find();
-    } catch {
-      throw new BadRequestException('Erro ao buscar permissões');
-    }
-  }
+  async execute(): Promise<Permission[]> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/permissions/getAllPermissions.handler.ts:18:9
   ) {}
 
   async execute(): Promise<Permission[]> {
-    try {
-      return await this.permissionRepository.find();
-    } catch {
+    try {} catch {
       throw new BadRequestException('Erro ao buscar permissões');
     }

[NoCoverage] BlockStatement
application/handlers/permissions/getAllPermissions.handler.ts:20:13
   async execute(): Promise<Permission[]> {
     try {
       return await this.permissionRepository.find();
-    } catch {
-      throw new BadRequestException('Erro ao buscar permissões');
-    }
+    } catch {}
   }
 }

[NoCoverage] StringLiteral
application/handlers/permissions/getAllPermissions.handler.ts:21:37
     try {
       return await this.permissionRepository.find();
     } catch {
-      throw new BadRequestException('Erro ao buscar permissões');
+      throw new BadRequestException("");
     }
   }
