[NoCoverage] BlockStatement
application/handlers/permissions/listSpecificPermission.handler.ts:17:76
     private readonly permissionRepository: Repository<Permission>,
   ) {}
 
-  async execute(query: ListSpecificPermissionQuery): Promise<Permission[]> {
-    const id = query.id;
-
-    try {
-      return await this.permissionRepository.find({
-        where: [{ id }],
-      });
-    } catch {
-      throw new BadRequestException('Erro ao buscar permissão');
-    }
-  }
+  async execute(query: ListSpecificPermissionQuery): Promise<Permission[]> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/permissions/listSpecificPermission.handler.ts:20:9
   async execute(query: ListSpecificPermissionQuery): Promise<Permission[]> {
     const id = query.id;
 
-    try {
-      return await this.permissionRepository.find({
-        where: [{ id }],
-      });
-    } catch {
+    try {} catch {
       throw new BadRequestException('Erro ao buscar permissão');
     }

[NoCoverage] BlockStatement
application/handlers/permissions/listSpecificPermission.handler.ts:24:13
       return await this.permissionRepository.find({
         where: [{ id }],
       });
-    } catch {
-      throw new BadRequestException('Erro ao buscar permissão');
-    }
+    } catch {}
   }
 }

[NoCoverage] StringLiteral
application/handlers/permissions/listSpecificPermission.handler.ts:25:37
         where: [{ id }],
       });
     } catch {
-      throw new BadRequestException('Erro ao buscar permissão');
+      throw new BadRequestException("");
     }
   }
