[NoCoverage] BlockStatement
src/api/controllers/user.controller.ts:40:64
     status: 400,
     description: 'Parâmetros inválidos ou e-mail/CPF já existente.',
   })
-  async createUser(@Body() body: CreateUserDTO): Promise<User> {
-    const { name, email, cpf, phone, addressId, password, roleId } = body;
-    const command = new CreateUserCommand(
-      name,
-      email,
-      cpf,
-      phone,
-      addressId,
-      password,
-      roleId,
-    );
-    return await this.commandBus.execute(command);
-  }
+  async createUser(@Body() body: CreateUserDTO): Promise<User> {}
 
   @Get('/')

[NoCoverage] BlockStatement
src/api/controllers/user.controller.ts:61:40
     description: 'Lista de usuários retornada com sucesso.',
     type: [User],
   })
-  async getAllUsers(): Promise<User[]> {
-    const query = new GetAllUsersQuery();
-    return await this.queryBus.execute(query);
-  }
+  async getAllUsers(): Promise<User[]> {}
 
   @Get('/:email')

[NoCoverage] BlockStatement
src/api/controllers/user.controller.ts:75:72
   })
   @ApiResponse({ status: 200, description: 'Usuário encontrado.', type: User })
   @ApiResponse({ status: 404, description: 'Usuário não encontrado.' })
-  async listSpecificUser(@Param('email') email: string): Promise<User> {
-    const query = new ListSpecificUserQuery(email);
-    return await this.queryBus.execute(query);
-  }
+  async listSpecificUser(@Param('email') email: string): Promise<User> {}
 
   @Delete('/delete/:email')

[NoCoverage] BlockStatement
src/api/controllers/user.controller.ts:105:65
     },
   })
   @ApiResponse({ status: 404, description: 'Usuário não encontrado.' })
-  async deleteUser(@Param('email') email: string): Promise<any> {
-    const command = new DeleteUserCommand(email);
-    return await this.commandBus.execute(command);
-  }
+  async deleteUser(@Param('email') email: string): Promise<any> {}
 
   @Patch('/:email')

[NoCoverage] BlockStatement
src/api/controllers/user.controller.ts:127:20
   async updateUser(
     @Param('email') email: string,
     @Body() body: UpdateUserDTO,
-  ): Promise<User> {
-    const command = new UpdateUserCommand(email, body);
-    return await this.commandBus.execute(command);
-  }
+  ): Promise<User> {}
 }
 
