[NoCoverage] BlockStatement
application/handlers/permissions/updatePermission.handler.ts:36:22
       permissionName: formattedName,
     });
 
-    if (!permission) {
-      throw new NotFoundException('Permissão não encontrada');
-    }
+    if (!permission) {}
 
     if (existingName) {

[NoCoverage] BlockStatement
application/handlers/permissions/updatePermission.handler.ts:44:39
       throw new ConflictException('Nome já utilizado por outra permissão');
     }
 
-    if (permissionName !== undefined) {
-      permission.permissionName = formattedName;
-    }
+    if (permissionName !== undefined) {}
 
     try {

[NoCoverage] ConditionalExpression
application/handlers/permissions/updatePermission.handler.ts:44:9
       throw new ConflictException('Nome já utilizado por outra permissão');
     }
 
-    if (permissionName !== undefined) {
+    if (true) {
       permission.permissionName = formattedName;
     }

[NoCoverage] BlockStatement
application/handlers/permissions/updatePermission.handler.ts:48:9
       permission.permissionName = formattedName;
     }
 
-    try {
-      const updatedPermission =
-        await this.permissionRepository.save(permission);
-      return {
-        message: 'Permissão atualizada com sucesso',
-        permission: updatedPermission,
-      };
-    } catch (error) {
+    try {} catch (error) {
       console.error('Erro ao atualizar permissões:', error);
       throw new BadRequestException(

[NoCoverage] StringLiteral
application/handlers/permissions/updatePermission.handler.ts:52:18
       const updatedPermission =
         await this.permissionRepository.save(permission);
       return {
-        message: 'Permissão atualizada com sucesso',
+        message: "",
         permission: updatedPermission,
       };

[NoCoverage] BlockStatement
application/handlers/permissions/updatePermission.handler.ts:55:21
         message: 'Permissão atualizada com sucesso',
         permission: updatedPermission,
       };
-    } catch (error) {
-      console.error('Erro ao atualizar permissões:', error);
-      throw new BadRequestException(
-        `Erro ao atualizar permissão. Detalhes: ${error.message || 'Erro desconhecido'}`,
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] LogicalOperator
application/handlers/permissions/updatePermission.handler.ts:58:51
     } catch (error) {
       console.error('Erro ao atualizar permissões:', error);
       throw new BadRequestException(
-        `Erro ao atualizar permissão. Detalhes: ${error.message || 'Erro desconhecido'}`,
+        `Erro ao atualizar permissão. Detalhes: ${error.message && 'Erro desconhecido'}`,
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/permissions/updatePermission.handler.ts:58:51
     } catch (error) {
       console.error('Erro ao atualizar permissões:', error);
       throw new BadRequestException(
-        `Erro ao atualizar permissão. Detalhes: ${error.message || 'Erro desconhecido'}`,
+        `Erro ao atualizar permissão. Detalhes: ${false}`,
       );
     }
