[NoCoverage] BlockStatement
application/commands/address/deleteAddress.command.ts:7:27
   @IsUUID()
   id: string;
 
-  constructor(id: string) {
-    this.id = id;
-  }
+  constructor(id: string) {}
 }
 
