[NoCoverage] BlockStatement
application/commands/doctor/updateDoctor.command.ts:13:5
     public readonly crm?: string,
     public readonly specialization?: string,
     public readonly shift?: string,
-  ) {
-    this.id = id;
-  }
+  ) {}
 }
 
