[NoCoverage] BlockStatement
application/handlers/address/createAddress.handler.ts:18:9
   ) {}
 
   async execute(command: CreateAddressCommand): Promise<any> {
-    try {
-      const {
-        cep,
-        country,
-        state,
-        city,
-        district,
-        street,
-        number,
-        complement,
-      } = command;
-
-      const address = this.addressRepository.create({
-        cep,
-        country,
-        state,
-        city,
-        district,
-        street,
-        number,
-        complement,
-      });
-
-      return await this.addressRepository.save(address);
-    } catch (error) {
+    try {} catch (error) {
       throw new BadRequestException(
         error.message ||

[NoCoverage] ObjectLiteral
application/handlers/address/createAddress.handler.ts:30:53
         complement,
       } = command;
 
-      const address = this.addressRepository.create({
-        cep,
-        country,
-        state,
-        city,
-        district,
-        street,
-        number,
-        complement,
-      });
+      const address = this.addressRepository.create({});
 
       return await this.addressRepository.save(address);

[NoCoverage] BlockStatement
application/handlers/address/createAddress.handler.ts:42:21
       });
 
       return await this.addressRepository.save(address);
-    } catch (error) {
-      throw new BadRequestException(
-        error.message ||
-          'Erro ao criar o endereço. Por favor, tente novamente.',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] LogicalOperator
application/handlers/address/createAddress.handler.ts:44:9
       return await this.addressRepository.save(address);
     } catch (error) {
       throw new BadRequestException(
-        error.message ||
-          'Erro ao criar o endereço. Por favor, tente novamente.',
+        error.message && 'Erro ao criar o endereço. Por favor, tente novamente.',
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/address/createAddress.handler.ts:44:9
       return await this.addressRepository.save(address);
     } catch (error) {
       throw new BadRequestException(
-        error.message ||
-          'Erro ao criar o endereço. Por favor, tente novamente.',
+        false,
       );
     }
