[NoCoverage] BlockStatement
application/handlers/address/deleteAddress.handler.ts:33:19
 
     const address = await this.addressRepository.findOneBy({ id });
 
-    if (!address) {
-      throw new NotFoundException('Endereço não encontrado');
-    }
+    if (!address) {}
 
     const linkedUser = await this.userRepository.findOne({

[NoCoverage] ConditionalExpression
application/handlers/address/deleteAddress.handler.ts:33:9
 
     const address = await this.addressRepository.findOneBy({ id });
 
-    if (!address) {
+    if (false) {
       throw new NotFoundException('Endereço não encontrado');
     }

[NoCoverage] ObjectLiteral
application/handlers/address/deleteAddress.handler.ts:38:25
     }
 
     const linkedUser = await this.userRepository.findOne({
-      where: { address: { id: id } },
+      where: { address: {} },
     });
 

[NoCoverage] ObjectLiteral
application/handlers/address/deleteAddress.handler.ts:38:14
     }
 
     const linkedUser = await this.userRepository.findOne({
-      where: { address: { id: id } },
+      where: {},
     });
 

[NoCoverage] ConditionalExpression
application/handlers/address/deleteAddress.handler.ts:41:9
       where: { address: { id: id } },
     });
 
-    if (linkedUser) {
+    if (true) {
       throw new ConflictException(
         'Este endereço está vinculado a um usuário e não pode ser excluído.',

[NoCoverage] ConditionalExpression
application/handlers/address/deleteAddress.handler.ts:41:9
       where: { address: { id: id } },
     });
 
-    if (linkedUser) {
+    if (false) {
       throw new ConflictException(
         'Este endereço está vinculado a um usuário e não pode ser excluído.',

[NoCoverage] BlockStatement
application/handlers/address/deleteAddress.handler.ts:47:9
       );
     }
 
-    try {
-      await this.addressRepository.delete(id);
-      return { message: 'Endereço deletado com sucesso', id };
-    } catch (error) {
+    try {} catch (error) {
       console.error(
         'Erro inesperado ao tentar deletar o endereço no banco:',

[NoCoverage] StringLiteral
application/handlers/address/deleteAddress.handler.ts:49:25
 
     try {
       await this.addressRepository.delete(id);
-      return { message: 'Endereço deletado com sucesso', id };
+      return { message: "", id };
     } catch (error) {
       console.error(

[NoCoverage] BlockStatement
application/handlers/address/deleteAddress.handler.ts:50:21
     try {
       await this.addressRepository.delete(id);
       return { message: 'Endereço deletado com sucesso', id };
-    } catch (error) {
-      console.error(
-        'Erro inesperado ao tentar deletar o endereço no banco:',
-        error,
-      );
-      throw new InternalServerErrorException(
-        `Ocorreu um erro no servidor ao tentar deletar o endereço. Detalhe: ${error.message}`,
-      );
-    }
+    } catch (error) {}
   }
 }
