[NoCoverage] BlockStatement
application/handlers/address/getAllAddress.handler.ts:15:39
     private readonly addressRepository: Repository<Address>,
   ) {}
 
-  async execute(): Promise<Address[]> {
-    try {
-      return await this.addressRepository.find();
-    } catch {
-      throw new BadRequestException('Erro ao buscar endereços');
-    }
-  }
+  async execute(): Promise<Address[]> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/address/getAllAddress.handler.ts:16:9
   ) {}
 
   async execute(): Promise<Address[]> {
-    try {
-      return await this.addressRepository.find();
-    } catch {
+    try {} catch {
       throw new BadRequestException('Erro ao buscar endereços');
     }

[NoCoverage] BlockStatement
application/handlers/address/getAllAddress.handler.ts:18:13
   async execute(): Promise<Address[]> {
     try {
       return await this.addressRepository.find();
-    } catch {
-      throw new BadRequestException('Erro ao buscar endereços');
-    }
+    } catch {}
   }
 }

[NoCoverage] StringLiteral
application/handlers/address/getAllAddress.handler.ts:19:37
     try {
       return await this.addressRepository.find();
     } catch {
-      throw new BadRequestException('Erro ao buscar endereços');
+      throw new BadRequestException("");
     }
   }
