[NoCoverage] BlockStatement
application/handlers/address/listSpecificAddress.handler.ts:17:70
     private readonly addressRepository: Repository<Address>,
   ) {}
 
-  async execute(query: ListSpecificAddressQuery): Promise<Address[]> {
-    const id = query.id;
-
-    try {
-      return await this.addressRepository.find({
-        where: [{ id }],
-      });
-    } catch {
-      throw new BadRequestException('Erro ao buscar endereço');
-    }
-  }
+  async execute(query: ListSpecificAddressQuery): Promise<Address[]> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/address/listSpecificAddress.handler.ts:20:9
   async execute(query: ListSpecificAddressQuery): Promise<Address[]> {
     const id = query.id;
 
-    try {
-      return await this.addressRepository.find({
-        where: [{ id }],
-      });
-    } catch {
+    try {} catch {
       throw new BadRequestException('Erro ao buscar endereço');
     }

[NoCoverage] ObjectLiteral
application/handlers/address/listSpecificAddress.handler.ts:22:17
 
     try {
       return await this.addressRepository.find({
-        where: [{ id }],
+        where: [{}],
       });
     } catch {

[NoCoverage] ArrayDeclaration
application/handlers/address/listSpecificAddress.handler.ts:22:16
 
     try {
       return await this.addressRepository.find({
-        where: [{ id }],
+        where: [],
       });
     } catch {

[NoCoverage] BlockStatement
application/handlers/address/listSpecificAddress.handler.ts:24:13
       return await this.addressRepository.find({
         where: [{ id }],
       });
-    } catch {
-      throw new BadRequestException('Erro ao buscar endereço');
-    }
+    } catch {}
   }
 }
