[NoCoverage] BooleanLiteral
application/handlers/address/updateAddress.handler.ts:39:9
 
     const address = await this.addressRepository.findOneBy({ id });
 
-    if (!address) {
+    if (address) {
       throw new NotFoundException('Endereço não encontrado');
     }

[NoCoverage] StringLiteral
application/handlers/address/updateAddress.handler.ts:40:35
     const address = await this.addressRepository.findOneBy({ id });
 
     if (!address) {
-      throw new NotFoundException('Endereço não encontrado');
+      throw new NotFoundException("");
     }
 

[NoCoverage] ConditionalExpression
application/handlers/address/updateAddress.handler.ts:43:9
       throw new NotFoundException('Endereço não encontrado');
     }
 
-    if (cep !== undefined) {
+    if (false) {
       address.cep = cep;
     }

[NoCoverage] EqualityOperator
application/handlers/address/updateAddress.handler.ts:43:9
       throw new NotFoundException('Endereço não encontrado');
     }
 
-    if (cep !== undefined) {
+    if (cep === undefined) {
       address.cep = cep;
     }

[NoCoverage] BlockStatement
application/handlers/address/updateAddress.handler.ts:46:32
     if (cep !== undefined) {
       address.cep = cep;
     }
-    if (country !== undefined) {
-      address.country = country;
-    }
+    if (country !== undefined) {}
     if (state !== undefined) {
       address.state = state;

[NoCoverage] ConditionalExpression
application/handlers/address/updateAddress.handler.ts:46:9
     if (cep !== undefined) {
       address.cep = cep;
     }
-    if (country !== undefined) {
+    if (false) {
       address.country = country;
     }

[NoCoverage] ConditionalExpression
application/handlers/address/updateAddress.handler.ts:49:9
     if (country !== undefined) {
       address.country = country;
     }
-    if (state !== undefined) {
+    if (true) {
       address.state = state;
     }

[NoCoverage] BlockStatement
application/handlers/address/updateAddress.handler.ts:49:30
     if (country !== undefined) {
       address.country = country;
     }
-    if (state !== undefined) {
-      address.state = state;
-    }
+    if (state !== undefined) {}
     if (city !== undefined) {
       address.city = city;

[NoCoverage] ConditionalExpression
application/handlers/address/updateAddress.handler.ts:52:9
     if (state !== undefined) {
       address.state = state;
     }
-    if (city !== undefined) {
+    if (false) {
       address.city = city;
     }

[NoCoverage] BlockStatement
application/handlers/address/updateAddress.handler.ts:52:29
     if (state !== undefined) {
       address.state = state;
     }
-    if (city !== undefined) {
-      address.city = city;
-    }
+    if (city !== undefined) {}
     if (district !== undefined) {
       address.district = district;

[NoCoverage] ConditionalExpression
application/handlers/address/updateAddress.handler.ts:55:9
     if (city !== undefined) {
       address.city = city;
     }
-    if (district !== undefined) {
+    if (false) {
       address.district = district;
     }

[NoCoverage] BlockStatement
application/handlers/address/updateAddress.handler.ts:55:33
     if (city !== undefined) {
       address.city = city;
     }
-    if (district !== undefined) {
-      address.district = district;
-    }
+    if (district !== undefined) {}
     if (street !== undefined) {
       address.street = street;

[NoCoverage] ConditionalExpression
application/handlers/address/updateAddress.handler.ts:58:9
     if (district !== undefined) {
       address.district = district;
     }
-    if (street !== undefined) {
+    if (true) {
       address.street = street;
     }

[NoCoverage] BlockStatement
application/handlers/address/updateAddress.handler.ts:58:31
     if (district !== undefined) {
       address.district = district;
     }
-    if (street !== undefined) {
-      address.street = street;
-    }
+    if (street !== undefined) {}
     if (number !== undefined) {
       address.number = number;

[NoCoverage] ConditionalExpression
application/handlers/address/updateAddress.handler.ts:61:9
     if (street !== undefined) {
       address.street = street;
     }
-    if (number !== undefined) {
+    if (false) {
       address.number = number;
     }

[NoCoverage] BlockStatement
application/handlers/address/updateAddress.handler.ts:61:31
     if (street !== undefined) {
       address.street = street;
     }
-    if (number !== undefined) {
-      address.number = number;
-    }
+    if (number !== undefined) {}
     if (command.hasOwnProperty('complement')) {
       address.complement = complement;

[NoCoverage] BlockStatement
application/handlers/address/updateAddress.handler.ts:64:47
     if (number !== undefined) {
       address.number = number;
     }
-    if (command.hasOwnProperty('complement')) {
-      address.complement = complement;
-    }
+    if (command.hasOwnProperty('complement')) {}
 
     try {

[NoCoverage] ConditionalExpression
application/handlers/address/updateAddress.handler.ts:64:9
     if (number !== undefined) {
       address.number = number;
     }
-    if (command.hasOwnProperty('complement')) {
+    if (true) {
       address.complement = complement;
     }

[NoCoverage] BlockStatement
application/handlers/address/updateAddress.handler.ts:68:9
       address.complement = complement;
     }
 
-    try {
-      const updatedAddress = await this.addressRepository.save(address);
-      return {
-        message: 'Endereço atualizado com sucesso',
-        address: updatedAddress,
-      };
-    } catch (error) {
+    try {} catch (error) {
       console.error('Erro ao atualizar endereço:', error);
       throw new BadRequestException(

[NoCoverage] BlockStatement
application/handlers/address/updateAddress.handler.ts:74:21
         message: 'Endereço atualizado com sucesso',
         address: updatedAddress,
       };
-    } catch (error) {
-      console.error('Erro ao atualizar endereço:', error);
-      throw new BadRequestException(
-        `Erro ao atualizar endereço. Detalhes: ${error.message || 'Erro desconhecido'}`,
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] StringLiteral
application/handlers/address/updateAddress.handler.ts:75:21
         address: updatedAddress,
       };
     } catch (error) {
-      console.error('Erro ao atualizar endereço:', error);
+      console.error("", error);
       throw new BadRequestException(
         `Erro ao atualizar endereço. Detalhes: ${error.message || 'Erro desconhecido'}`,

[NoCoverage] LogicalOperator
application/handlers/address/updateAddress.handler.ts:77:50
     } catch (error) {
       console.error('Erro ao atualizar endereço:', error);
       throw new BadRequestException(
-        `Erro ao atualizar endereço. Detalhes: ${error.message || 'Erro desconhecido'}`,
+        `Erro ao atualizar endereço. Detalhes: ${error.message && 'Erro desconhecido'}`,
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/address/updateAddress.handler.ts:77:50
     } catch (error) {
       console.error('Erro ao atualizar endereço:', error);
       throw new BadRequestException(
-        `Erro ao atualizar endereço. Detalhes: ${error.message || 'Erro desconhecido'}`,
+        `Erro ao atualizar endereço. Detalhes: ${true}`,
       );
     }
