[NoCoverage] BlockStatement
application/handlers/doctor/createDoctor.handler.ts:28:26
         where: [{ id: userId }],
       });
 
-      if (!existingUser) {
-        throw new ConflictException('User não cadastrado no sistema');
-      }
+      if (!existingUser) {}
 
       const existingDoctor = await this.doctorRepository.findOne({

[NoCoverage] ConditionalExpression
application/handlers/doctor/createDoctor.handler.ts:28:11
         where: [{ id: userId }],
       });
 
-      if (!existingUser) {
+      if (false) {
         throw new ConflictException('User não cadastrado no sistema');
       }

[NoCoverage] ObjectLiteral
application/handlers/doctor/createDoctor.handler.ts:33:17
       }
 
       const existingDoctor = await this.doctorRepository.findOne({
-        where: [{ crm }],
+        where: [{}],
       });
 

[NoCoverage] BlockStatement
application/handlers/doctor/createDoctor.handler.ts:36:27
         where: [{ crm }],
       });
 
-      if (existingDoctor) {
-        throw new ConflictException('CRM já cadastrado no sistema');
-      }
+      if (existingDoctor) {}
 
       const doctor = this.doctorRepository.create({

[NoCoverage] ConditionalExpression
application/handlers/doctor/createDoctor.handler.ts:36:11
         where: [{ crm }],
       });
 
-      if (existingDoctor) {
+      if (true) {
         throw new ConflictException('CRM já cadastrado no sistema');
       }

[NoCoverage] BlockStatement
application/handlers/doctor/createDoctor.handler.ts:48:21
       });
 
       return await this.doctorRepository.save(doctor);
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao criar médico. Por favor, tente novamente.',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] LogicalOperator
application/handlers/doctor/createDoctor.handler.ts:50:9
       return await this.doctorRepository.save(doctor);
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao criar médico. Por favor, tente novamente.',
+        error.message && 'Erro ao criar médico. Por favor, tente novamente.',
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/doctor/createDoctor.handler.ts:50:9
       return await this.doctorRepository.save(doctor);
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao criar médico. Por favor, tente novamente.',
+        true,
       );
     }
