[NoCoverage] BlockStatement
application/handlers/doctor/deleteDoctor.handler.ts:17:61
     private readonly doctorRepository: Repository<Doctor>,
   ) {}
 
-  async execute(command: DeleteDoctorCommand): Promise<any> {
-    try {
-      const { id } = command;
-
-      const existingDoctor = await this.doctorRepository.find({
-        where: [{ id }],
-      });
-
-      if (!existingDoctor) {
-        throw new NotFoundException('Médico(a) não encontrado(a).');
-      }
-
-      await this.doctorRepository.delete({ id });
-
-      return { message: 'Médico(a) deletado com sucesso', id };
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao deletar médico(a).',
-      );
-    }
-  }
+  async execute(command: DeleteDoctorCommand): Promise<any> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/doctor/deleteDoctor.handler.ts:18:9
   ) {}
 
   async execute(command: DeleteDoctorCommand): Promise<any> {
-    try {
-      const { id } = command;
-
-      const existingDoctor = await this.doctorRepository.find({
-        where: [{ id }],
-      });
-
-      if (!existingDoctor) {
-        throw new NotFoundException('Médico(a) não encontrado(a).');
-      }
-
-      await this.doctorRepository.delete({ id });
-
-      return { message: 'Médico(a) deletado com sucesso', id };
-    } catch (error) {
+    try {} catch (error) {
       throw new BadRequestException(
         error.message || 'Erro ao deletar médico(a).',

[NoCoverage] ArrayDeclaration
application/handlers/doctor/deleteDoctor.handler.ts:22:16
       const { id } = command;
 
       const existingDoctor = await this.doctorRepository.find({
-        where: [{ id }],
+        where: [],
       });
 

[NoCoverage] ObjectLiteral
application/handlers/doctor/deleteDoctor.handler.ts:22:17
       const { id } = command;
 
       const existingDoctor = await this.doctorRepository.find({
-        where: [{ id }],
+        where: [{}],
       });
 

[NoCoverage] BooleanLiteral
application/handlers/doctor/deleteDoctor.handler.ts:25:11
         where: [{ id }],
       });
 
-      if (!existingDoctor) {
+      if (existingDoctor) {
         throw new NotFoundException('Médico(a) não encontrado(a).');
       }

[NoCoverage] BlockStatement
application/handlers/doctor/deleteDoctor.handler.ts:25:28
         where: [{ id }],
       });
 
-      if (!existingDoctor) {
-        throw new NotFoundException('Médico(a) não encontrado(a).');
-      }
+      if (!existingDoctor) {}
 
       await this.doctorRepository.delete({ id });

[NoCoverage] StringLiteral
application/handlers/doctor/deleteDoctor.handler.ts:26:37
       });
 
       if (!existingDoctor) {
-        throw new NotFoundException('Médico(a) não encontrado(a).');
+        throw new NotFoundException("");
       }
 

[NoCoverage] BlockStatement
application/handlers/doctor/deleteDoctor.handler.ts:32:21
       await this.doctorRepository.delete({ id });
 
       return { message: 'Médico(a) deletado com sucesso', id };
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao deletar médico(a).',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] ConditionalExpression
application/handlers/doctor/deleteDoctor.handler.ts:34:9
       return { message: 'Médico(a) deletado com sucesso', id };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao deletar médico(a).',
+        true,
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/doctor/deleteDoctor.handler.ts:34:9
       return { message: 'Médico(a) deletado com sucesso', id };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao deletar médico(a).',
+        false,
       );
     }
