[NoCoverage] BlockStatement
application/handlers/doctor/getAllDoctors.handler.ts:15:59
     private readonly doctorRepository: Repository<Doctor>,
   ) {}
 
-  async execute(_query: GetAllDoctorsQuery): Promise<any> {
-    try {
-      return await this.doctorRepository.find({
-        select: {
-          user: {
-            id: true,
-            name: true,
-            email: true,
-            cpf: true,
-            phone: true,
-            isActive: true,
-            password: false,
-            addressId: true,
-            roleId: true,
-          },
-        },
-        relations: ['user'],
-      });
-    } catch (error) {
-      throw new BadRequestException(error.message || 'Erro ao buscar médico');
-    }
-  }
+  async execute(_query: GetAllDoctorsQuery): Promise<any> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/doctor/getAllDoctors.handler.ts:16:9
   ) {}
 
   async execute(_query: GetAllDoctorsQuery): Promise<any> {
-    try {
-      return await this.doctorRepository.find({
-        select: {
-          user: {
-            id: true,
-            name: true,
-            email: true,
-            cpf: true,
-            phone: true,
-            isActive: true,
-            password: false,
-            addressId: true,
-            roleId: true,
-          },
-        },
-        relations: ['user'],
-      });
-    } catch (error) {
+    try {} catch (error) {
       throw new BadRequestException(error.message || 'Erro ao buscar médico');
     }

[NoCoverage] ObjectLiteral
application/handlers/doctor/getAllDoctors.handler.ts:17:47
 
   async execute(_query: GetAllDoctorsQuery): Promise<any> {
     try {
-      return await this.doctorRepository.find({
-        select: {
-          user: {
-            id: true,
-            name: true,
-            email: true,
-            cpf: true,
-            phone: true,
-            isActive: true,
-            password: false,
-            addressId: true,
-            roleId: true,
-          },
-        },
-        relations: ['user'],
-      });
+      return await this.doctorRepository.find({});
     } catch (error) {
       throw new BadRequestException(error.message || 'Erro ao buscar médico');

[NoCoverage] ObjectLiteral
application/handlers/doctor/getAllDoctors.handler.ts:18:17
   async execute(_query: GetAllDoctorsQuery): Promise<any> {
     try {
       return await this.doctorRepository.find({
-        select: {
-          user: {
-            id: true,
-            name: true,
-            email: true,
-            cpf: true,
-            phone: true,
-            isActive: true,
-            password: false,
-            addressId: true,
-            roleId: true,
-          },
-        },
+        select: {},
         relations: ['user'],
       });

[NoCoverage] ObjectLiteral
application/handlers/doctor/getAllDoctors.handler.ts:19:17
     try {
       return await this.doctorRepository.find({
         select: {
-          user: {
-            id: true,
-            name: true,
-            email: true,
-            cpf: true,
-            phone: true,
-            isActive: true,
-            password: false,
-            addressId: true,
-            roleId: true,
-          },
+          user: {},
         },
         relations: ['user'],

[NoCoverage] BooleanLiteral
application/handlers/doctor/getAllDoctors.handler.ts:20:17
       return await this.doctorRepository.find({
         select: {
           user: {
-            id: true,
+            id: false,
             name: true,
             email: true,

[NoCoverage] BooleanLiteral
application/handlers/doctor/getAllDoctors.handler.ts:21:19
         select: {
           user: {
             id: true,
-            name: true,
+            name: false,
             email: true,
             cpf: true,

[NoCoverage] BooleanLiteral
application/handlers/doctor/getAllDoctors.handler.ts:22:20
           user: {
             id: true,
             name: true,
-            email: true,
+            email: false,
             cpf: true,
             phone: true,

[NoCoverage] BooleanLiteral
application/handlers/doctor/getAllDoctors.handler.ts:23:18
             id: true,
             name: true,
             email: true,
-            cpf: true,
+            cpf: false,
             phone: true,
             isActive: true,

[NoCoverage] BooleanLiteral
application/handlers/doctor/getAllDoctors.handler.ts:24:20
             name: true,
             email: true,
             cpf: true,
-            phone: true,
+            phone: false,
             isActive: true,
             password: false,

[NoCoverage] BooleanLiteral
application/handlers/doctor/getAllDoctors.handler.ts:25:23
             email: true,
             cpf: true,
             phone: true,
-            isActive: true,
+            isActive: false,
             password: false,
             addressId: true,

[NoCoverage] BooleanLiteral
application/handlers/doctor/getAllDoctors.handler.ts:26:23
             cpf: true,
             phone: true,
             isActive: true,
-            password: false,
+            password: true,
             addressId: true,
             roleId: true,

[NoCoverage] BooleanLiteral
application/handlers/doctor/getAllDoctors.handler.ts:27:24
             phone: true,
             isActive: true,
             password: false,
-            addressId: true,
+            addressId: false,
             roleId: true,
           },

[NoCoverage] BooleanLiteral
application/handlers/doctor/getAllDoctors.handler.ts:28:21
             isActive: true,
             password: false,
             addressId: true,
-            roleId: true,
+            roleId: false,
           },
         },

[NoCoverage] BlockStatement
application/handlers/doctor/getAllDoctors.handler.ts:33:21
         },
         relations: ['user'],
       });
-    } catch (error) {
-      throw new BadRequestException(error.message || 'Erro ao buscar médico');
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] LogicalOperator
application/handlers/doctor/getAllDoctors.handler.ts:34:37
         relations: ['user'],
       });
     } catch (error) {
-      throw new BadRequestException(error.message || 'Erro ao buscar médico');
+      throw new BadRequestException(error.message && 'Erro ao buscar médico');
     }
   }

[NoCoverage] ConditionalExpression
application/handlers/doctor/getAllDoctors.handler.ts:34:37
         relations: ['user'],
       });
     } catch (error) {
-      throw new BadRequestException(error.message || 'Erro ao buscar médico');
+      throw new BadRequestException(false);
     }
   }
