[NoCoverage] ObjectLiteral
application/handlers/doctor/listSpecificDoctor.handler.ts:22:17
       const { id } = query;
 
       const existingNurse = await this.doctorRepository.find({
-        where: [{ id }],
+        where: [{}],
       });
 

[NoCoverage] ConditionalExpression
application/handlers/doctor/listSpecificDoctor.handler.ts:25:11
         where: [{ id }],
       });
 
-      if (!existingNurse) {
+      if (true) {
         throw new NotFoundException('Médico(a) não encontrado(a).');
       }

[NoCoverage] BlockStatement
application/handlers/doctor/listSpecificDoctor.handler.ts:25:27
         where: [{ id }],
       });
 
-      if (!existingNurse) {
-        throw new NotFoundException('Médico(a) não encontrado(a).');
-      }
+      if (!existingNurse) {}
 
       return this.doctorRepository.findOne({

[NoCoverage] ObjectLiteral
application/handlers/doctor/listSpecificDoctor.handler.ts:29:44
         throw new NotFoundException('Médico(a) não encontrado(a).');
       }
 
-      return this.doctorRepository.findOne({
-        select: {
-          user: {
-            id: true,
-            name: true,
-            email: true,
-            cpf: true,
-            phone: true,
-            isActive: true,
-            password: false,
-            addressId: true,
-            roleId: true,
-          },
-        },
-        where: { id },
-        relations: ['user'],
-      });
+      return this.doctorRepository.findOne({});
     } catch (error) {
       throw new BadRequestException(

[NoCoverage] BlockStatement
application/handlers/doctor/listSpecificDoctor.handler.ts:46:21
         where: { id },
         relations: ['user'],
       });
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao buscar médico(a)',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] LogicalOperator
application/handlers/doctor/listSpecificDoctor.handler.ts:48:9
       });
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao buscar médico(a)',
+        error.message && 'Erro ao buscar médico(a)',
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/doctor/listSpecificDoctor.handler.ts:48:9
       });
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao buscar médico(a)',
+        true,
       );
     }
