[NoCoverage] BooleanLiteral
application/handlers/doctor/updateDoctor.handler.ts:29:11
         where: [{ id }],
       });
 
-      if (!nurse) {
+      if (nurse) {
         throw new NotFoundException('Médico(a) não encontrado(a).');
       }

[NoCoverage] ConditionalExpression
application/handlers/doctor/updateDoctor.handler.ts:29:11
         where: [{ id }],
       });
 
-      if (!nurse) {
+      if (false) {
         throw new NotFoundException('Médico(a) não encontrado(a).');
       }

[NoCoverage] LogicalOperator
application/handlers/doctor/updateDoctor.handler.ts:33:11
         throw new NotFoundException('Médico(a) não encontrado(a).');
       }
 
-      if (crm && crm !== nurse.crm) {
+      if (crm || crm !== nurse.crm) {
         const existingCoren = await this.doctorRepository.findOne({
           where: [{ crm }],

[NoCoverage] EqualityOperator
application/handlers/doctor/updateDoctor.handler.ts:33:18
         throw new NotFoundException('Médico(a) não encontrado(a).');
       }
 
-      if (crm && crm !== nurse.crm) {
+      if (crm && crm === nurse.crm) {
         const existingCoren = await this.doctorRepository.findOne({
           where: [{ crm }],

[NoCoverage] ObjectLiteral
application/handlers/doctor/updateDoctor.handler.ts:34:67
       }
 
       if (crm && crm !== nurse.crm) {
-        const existingCoren = await this.doctorRepository.findOne({
-          where: [{ crm }],
-        });
+        const existingCoren = await this.doctorRepository.findOne({});
 
         if (existingCoren) {

[NoCoverage] BlockStatement
application/handlers/doctor/updateDoctor.handler.ts:38:28
           where: [{ crm }],
         });
 
-        if (existingCoren) {
-          throw new ConflictException('CRM já cadastrado no sistema.');
-        }
+        if (existingCoren) {}
       }
 

[NoCoverage] ConditionalExpression
application/handlers/doctor/updateDoctor.handler.ts:38:13
           where: [{ crm }],
         });
 
-        if (existingCoren) {
+        if (false) {
           throw new ConflictException('CRM já cadastrado no sistema.');
         }

[NoCoverage] StringLiteral
application/handlers/doctor/updateDoctor.handler.ts:39:39
         });
 
         if (existingCoren) {
-          throw new ConflictException('CRM já cadastrado no sistema.');
+          throw new ConflictException("");
         }
       }

[NoCoverage] EqualityOperator
application/handlers/doctor/updateDoctor.handler.ts:43:11
         }
       }
 
-      if (crm !== undefined) {
+      if (crm === undefined) {
         nurse.crm = crm;
       }

[NoCoverage] ConditionalExpression
application/handlers/doctor/updateDoctor.handler.ts:43:11
         }
       }
 
-      if (crm !== undefined) {
+      if (true) {
         nurse.crm = crm;
       }

[NoCoverage] ConditionalExpression
application/handlers/doctor/updateDoctor.handler.ts:47:11
         nurse.crm = crm;
       }
 
-      if (specialization !== undefined) {
+      if (true) {
         nurse.specialization = specialization;
       }

[NoCoverage] BlockStatement
application/handlers/doctor/updateDoctor.handler.ts:47:41
         nurse.crm = crm;
       }
 
-      if (specialization !== undefined) {
-        nurse.specialization = specialization;
-      }
+      if (specialization !== undefined) {}
 
       if (shift !== undefined) {

[NoCoverage] ConditionalExpression
application/handlers/doctor/updateDoctor.handler.ts:51:11
         nurse.specialization = specialization;
       }
 
-      if (shift !== undefined) {
+      if (false) {
         nurse.shift = shift;
       }

[NoCoverage] ConditionalExpression
application/handlers/doctor/updateDoctor.handler.ts:51:11
         nurse.specialization = specialization;
       }
 
-      if (shift !== undefined) {
+      if (true) {
         nurse.shift = shift;
       }

[NoCoverage] BlockStatement
application/handlers/doctor/updateDoctor.handler.ts:56:21
       }
 
       return await this.doctorRepository.save(nurse);
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao atualizar médico(a).',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] LogicalOperator
application/handlers/doctor/updateDoctor.handler.ts:58:9
       return await this.doctorRepository.save(nurse);
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao atualizar médico(a).',
+        error.message && 'Erro ao atualizar médico(a).',
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/doctor/updateDoctor.handler.ts:58:9
       return await this.doctorRepository.save(nurse);
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao atualizar médico(a).',
+        true,
       );
     }
