[NoCoverage] ConditionalExpression
application/handlers/nurse/createNurse.handler.ts:26:11
         where: [{ id: userId }],
       });
 
-      if (!existingUser) {
+      if (true) {
         throw new ConflictException('User não cadastrado no sistema');
       }

[NoCoverage] StringLiteral
application/handlers/nurse/createNurse.handler.ts:27:37
       });
 
       if (!existingUser) {
-        throw new ConflictException('User não cadastrado no sistema');
+        throw new ConflictException("");
       }
 

[NoCoverage] BlockStatement
application/handlers/nurse/createNurse.handler.ts:34:26
         where: [{ coren }],
       });
 
-      if (existingNurse) {
-        throw new ConflictException('COREN já cadastrado no sistema');
-      }
+      if (existingNurse) {}
 
       const nurse = this.nurseRepository.create({

[NoCoverage] ConditionalExpression
application/handlers/nurse/createNurse.handler.ts:34:11
         where: [{ coren }],
       });
 
-      if (existingNurse) {
+      if (true) {
         throw new ConflictException('COREN já cadastrado no sistema');
       }

[NoCoverage] StringLiteral
application/handlers/nurse/createNurse.handler.ts:35:37
       });
 
       if (existingNurse) {
-        throw new ConflictException('COREN já cadastrado no sistema');
+        throw new ConflictException("");
       }
 

[NoCoverage] ObjectLiteral
application/handlers/nurse/createNurse.handler.ts:38:49
         throw new ConflictException('COREN já cadastrado no sistema');
       }
 
-      const nurse = this.nurseRepository.create({
-        user: userId,
-        coren,
-        specialization,
-        shift,
-      });
+      const nurse = this.nurseRepository.create({});
 
       return await this.nurseRepository.save(nurse);

[NoCoverage] BlockStatement
application/handlers/nurse/createNurse.handler.ts:46:21
       });
 
       return await this.nurseRepository.save(nurse);
-    } catch (error) {
-      throw new BadRequestException(
-        error.message ||
-          'Erro ao criar enfermeira. Por favor, tente novamente.',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] ConditionalExpression
application/handlers/nurse/createNurse.handler.ts:48:9
       return await this.nurseRepository.save(nurse);
     } catch (error) {
       throw new BadRequestException(
-        error.message ||
-          'Erro ao criar enfermeira. Por favor, tente novamente.',
+        true,
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/nurse/createNurse.handler.ts:48:9
       return await this.nurseRepository.save(nurse);
     } catch (error) {
       throw new BadRequestException(
-        error.message ||
-          'Erro ao criar enfermeira. Por favor, tente novamente.',
+        false,
       );
     }
