[NoCoverage] BlockStatement
application/handlers/nurse/deleteNurse.handler.ts:15:60
     private readonly nurseRepository: Repository<Nurse>,
   ) {}
 
-  async execute(command: DeleteNurseCommand): Promise<any> {
-    try {
-      const { id } = command;
-
-      const existingNurse = await this.nurseRepository.find({
-        where: [{ id }],
-      });
-
-      if (!existingNurse) {
-        throw new NotFoundException('Enfermeiro(a) não encontrado(a).');
-      }
-
-      await this.nurseRepository.delete({ id });
-
-      return { message: 'Enfermeiro(a) deletado com sucesso', id };
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao deletar enfermeiro(a).',
-      );
-    }
-  }
+  async execute(command: DeleteNurseCommand): Promise<any> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/nurse/deleteNurse.handler.ts:16:9
   ) {}
 
   async execute(command: DeleteNurseCommand): Promise<any> {
-    try {
-      const { id } = command;
-
-      const existingNurse = await this.nurseRepository.find({
-        where: [{ id }],
-      });
-
-      if (!existingNurse) {
-        throw new NotFoundException('Enfermeiro(a) não encontrado(a).');
-      }
-
-      await this.nurseRepository.delete({ id });
-
-      return { message: 'Enfermeiro(a) deletado com sucesso', id };
-    } catch (error) {
+    try {} catch (error) {
       throw new BadRequestException(
         error.message || 'Erro ao deletar enfermeiro(a).',

[NoCoverage] ConditionalExpression
application/handlers/nurse/deleteNurse.handler.ts:23:11
         where: [{ id }],
       });
 
-      if (!existingNurse) {
+      if (false) {
         throw new NotFoundException('Enfermeiro(a) não encontrado(a).');
       }

[NoCoverage] BlockStatement
application/handlers/nurse/deleteNurse.handler.ts:30:21
       await this.nurseRepository.delete({ id });
 
       return { message: 'Enfermeiro(a) deletado com sucesso', id };
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao deletar enfermeiro(a).',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] LogicalOperator
application/handlers/nurse/deleteNurse.handler.ts:32:9
       return { message: 'Enfermeiro(a) deletado com sucesso', id };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao deletar enfermeiro(a).',
+        error.message && 'Erro ao deletar enfermeiro(a).',
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/nurse/deleteNurse.handler.ts:32:9
       return { message: 'Enfermeiro(a) deletado com sucesso', id };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao deletar enfermeiro(a).',
+        true,
       );
     }
