[NoCoverage] BlockStatement
application/handlers/nurse/getAllNurses.handler.ts:15:58
     private readonly nurseRepository: Repository<Nurse>,
   ) {}
 
-  async execute(_query: GetAllNursesQuery): Promise<any> {
-    try {
-      return await this.nurseRepository.find({
-        select: {
-          user: {
-            id: true,
-            name: true,
-            email: true,
-            cpf: true,
-            phone: true,
-            isActive: true,
-            password: false,
-            addressId: true,
-            roleId: true,
-          },
-        },
-        relations: ['user'],
-      });
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao buscar enfermeira',
-      );
-    }
-  }
+  async execute(_query: GetAllNursesQuery): Promise<any> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/nurse/getAllNurses.handler.ts:16:9
   ) {}
 
   async execute(_query: GetAllNursesQuery): Promise<any> {
-    try {
-      return await this.nurseRepository.find({
-        select: {
-          user: {
-            id: true,
-            name: true,
-            email: true,
-            cpf: true,
-            phone: true,
-            isActive: true,
-            password: false,
-            addressId: true,
-            roleId: true,
-          },
-        },
-        relations: ['user'],
-      });
-    } catch (error) {
+    try {} catch (error) {
       throw new BadRequestException(
         error.message || 'Erro ao buscar enfermeira',

[NoCoverage] StringLiteral
application/handlers/nurse/getAllNurses.handler.ts:31:21
             roleId: true,
           },
         },
-        relations: ['user'],
+        relations: [""],
       });
     } catch (error) {

[NoCoverage] ArrayDeclaration
application/handlers/nurse/getAllNurses.handler.ts:31:20
             roleId: true,
           },
         },
-        relations: ['user'],
+        relations: [],
       });
     } catch (error) {

[NoCoverage] BlockStatement
application/handlers/nurse/getAllNurses.handler.ts:33:21
         },
         relations: ['user'],
       });
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao buscar enfermeira',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] ConditionalExpression
application/handlers/nurse/getAllNurses.handler.ts:35:9
       });
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao buscar enfermeira',
+        false,
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/nurse/getAllNurses.handler.ts:35:9
       });
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao buscar enfermeira',
+        true,
       );
     }
