[NoCoverage] ObjectLiteral
application/handlers/nurse/listSpecificNurse.handler.ts:21:61
     try {
       const { id } = query;
 
-      const existingNurse = await this.nurseRepository.find({
-        where: [{ id }],
-      });
+      const existingNurse = await this.nurseRepository.find({});
 
       if (!existingNurse) {

[NoCoverage] ObjectLiteral
application/handlers/nurse/listSpecificNurse.handler.ts:22:17
       const { id } = query;
 
       const existingNurse = await this.nurseRepository.find({
-        where: [{ id }],
+        where: [{}],
       });
 

[NoCoverage] BooleanLiteral
application/handlers/nurse/listSpecificNurse.handler.ts:25:11
         where: [{ id }],
       });
 
-      if (!existingNurse) {
+      if (existingNurse) {
         throw new NotFoundException('Enfermeiro(a) não encontrado(a).');
       }

[NoCoverage] StringLiteral
application/handlers/nurse/listSpecificNurse.handler.ts:26:37
       });
 
       if (!existingNurse) {
-        throw new NotFoundException('Enfermeiro(a) não encontrado(a).');
+        throw new NotFoundException("");
       }
 

[NoCoverage] ObjectLiteral
application/handlers/nurse/listSpecificNurse.handler.ts:29:43
         throw new NotFoundException('Enfermeiro(a) não encontrado(a).');
       }
 
-      return this.nurseRepository.findOne({
-        select: {
-          user: {
-            id: true,
-            name: true,
-            email: true,
-            cpf: true,
-            phone: true,
-            isActive: true,
-            password: false,
-            addressId: true,
-            roleId: true,
-          },
-        },
-        where: { id },
-        relations: ['user'],
-      });
+      return this.nurseRepository.findOne({});
     } catch (error) {
       throw new BadRequestException(

[NoCoverage] ArrayDeclaration
application/handlers/nurse/listSpecificNurse.handler.ts:44:20
           },
         },
         where: { id },
-        relations: ['user'],
+        relations: [],
       });
     } catch (error) {

[NoCoverage] BlockStatement
application/handlers/nurse/listSpecificNurse.handler.ts:46:21
         where: { id },
         relations: ['user'],
       });
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao buscar enfermeiro(a)',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] LogicalOperator
application/handlers/nurse/listSpecificNurse.handler.ts:48:9
       });
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao buscar enfermeiro(a)',
+        error.message && 'Erro ao buscar enfermeiro(a)',
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/nurse/listSpecificNurse.handler.ts:48:9
       });
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao buscar enfermeiro(a)',
+        false,
       );
     }
