[NoCoverage] ConditionalExpression
application/handlers/nurse/updateNurse.handler.ts:31:20
         throw new NotFoundException('Enfermeiro(a) não encontrado(a).');
       }
 
-      if (coren && coren !== nurse.coren) {
+      if (coren && true) {
         const existingCoren = await this.nurseRepository.findOne({
           where: [{ coren }],

[NoCoverage] ConditionalExpression
application/handlers/nurse/updateNurse.handler.ts:31:11
         throw new NotFoundException('Enfermeiro(a) não encontrado(a).');
       }
 
-      if (coren && coren !== nurse.coren) {
+      if (true) {
         const existingCoren = await this.nurseRepository.findOne({
           where: [{ coren }],

[NoCoverage] ConditionalExpression
application/handlers/nurse/updateNurse.handler.ts:36:13
           where: [{ coren }],
         });
 
-        if (existingCoren) {
+        if (true) {
           throw new ConflictException('COREN já cadastrado no sistema.');
         }

[NoCoverage] StringLiteral
application/handlers/nurse/updateNurse.handler.ts:37:39
         });
 
         if (existingCoren) {
-          throw new ConflictException('COREN já cadastrado no sistema.');
+          throw new ConflictException("");
         }
       }

[NoCoverage] BlockStatement
application/handlers/nurse/updateNurse.handler.ts:41:32
         }
       }
 
-      if (coren !== undefined) {
-        nurse.coren = coren;
-      }
+      if (coren !== undefined) {}
 
       if (specialization !== undefined) {

[NoCoverage] EqualityOperator
application/handlers/nurse/updateNurse.handler.ts:41:11
         }
       }
 
-      if (coren !== undefined) {
+      if (coren === undefined) {
         nurse.coren = coren;
       }

[NoCoverage] ConditionalExpression
application/handlers/nurse/updateNurse.handler.ts:45:11
         nurse.coren = coren;
       }
 
-      if (specialization !== undefined) {
+      if (false) {
         nurse.specialization = specialization;
       }

[NoCoverage] EqualityOperator
application/handlers/nurse/updateNurse.handler.ts:49:11
         nurse.specialization = specialization;
       }
 
-      if (shift !== undefined) {
+      if (shift === undefined) {
         nurse.shift = shift;
       }

[NoCoverage] BlockStatement
application/handlers/nurse/updateNurse.handler.ts:54:21
       }
 
       return await this.nurseRepository.save(nurse);
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao atualizar enfermeiro(a).',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] ConditionalExpression
application/handlers/nurse/updateNurse.handler.ts:56:9
       return await this.nurseRepository.save(nurse);
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao atualizar enfermeiro(a).',
+        true,
       );
     }

[NoCoverage] LogicalOperator
application/handlers/nurse/updateNurse.handler.ts:56:9
       return await this.nurseRepository.save(nurse);
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao atualizar enfermeiro(a).',
+        error.message && 'Erro ao atualizar enfermeiro(a).',
       );
     }
