[NoCoverage] MethodExpression
application/handlers/role/createRole.handler.ts:19:29
     try {
       const { name } = command;
 
-      const formattedName = name.toUpperCase();
+      const formattedName = name.toLowerCase();
 
       const existingRole = await this.roleRepository.findOne({

[NoCoverage] ConditionalExpression
application/handlers/role/createRole.handler.ts:25:11
         where: [{ name: formattedName }],
       });
 
-      if (existingRole) {
+      if (false) {
         throw new BadRequestException(
           'Nome de role já em uso. Por favor, tente novamente com outros dados.',

[NoCoverage] ConditionalExpression
application/handlers/role/createRole.handler.ts:25:11
         where: [{ name: formattedName }],
       });
 
-      if (existingRole) {
+      if (true) {
         throw new BadRequestException(
           'Nome de role já em uso. Por favor, tente novamente com outros dados.',

[NoCoverage] StringLiteral
application/handlers/role/createRole.handler.ts:27:11
 
       if (existingRole) {
         throw new BadRequestException(
-          'Nome de role já em uso. Por favor, tente novamente com outros dados.',
+          "",
         );
       }

[NoCoverage] BlockStatement
application/handlers/role/createRole.handler.ts:43:21
           name: role.name,
         },
       };
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao criar role. Por favor, tente novamente.',
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] ConditionalExpression
application/handlers/role/createRole.handler.ts:45:9
       };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao criar role. Por favor, tente novamente.',
+        true,
       );
     }

[NoCoverage] LogicalOperator
application/handlers/role/createRole.handler.ts:45:9
       };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao criar role. Por favor, tente novamente.',
+        error.message && 'Erro ao criar role. Por favor, tente novamente.',
       );
     }
