[NoCoverage] ConditionalExpression
application/handlers/role/deleteRole.handler.ts:31:9
 
     const role = await this.roleRepository.findOneBy({ id });
 
-    if (!role) {
+    if (true) {
       throw new NotFoundException('Role não encontrada');
     }

[NoCoverage] BlockStatement
application/handlers/role/deleteRole.handler.ts:31:16
 
     const role = await this.roleRepository.findOneBy({ id });
 
-    if (!role) {
-      throw new NotFoundException('Role não encontrada');
-    }
+    if (!role) {}
 
     const linkedUser = await this.userRepository.findOne({

[NoCoverage] ObjectLiteral
application/handlers/role/deleteRole.handler.ts:36:14
     }
 
     const linkedUser = await this.userRepository.findOne({
-      where: { role: { id: id } },
+      where: {},
     });
 

[NoCoverage] StringLiteral
application/handlers/role/deleteRole.handler.ts:41:9
 
     if (linkedUser) {
       throw new ConflictException(
-        'Esta role está vinculada a um usuário e não pode ser excluída.',
+        "",
       );
     }

[NoCoverage] BlockStatement
application/handlers/role/deleteRole.handler.ts:45:9
       );
     }
 
-    try {
-      await this.roleRepository.delete(id);
-      return { message: 'Role deletada com sucesso', id };
-    } catch (error) {
+    try {} catch (error) {
       console.error(
         'Erro inesperado ao tentar deletar a role no banco:',

[NoCoverage] ObjectLiteral
application/handlers/role/deleteRole.handler.ts:47:14
 
     try {
       await this.roleRepository.delete(id);
-      return { message: 'Role deletada com sucesso', id };
+      return {};
     } catch (error) {
       console.error(

[NoCoverage] StringLiteral
application/handlers/role/deleteRole.handler.ts:47:25
 
     try {
       await this.roleRepository.delete(id);
-      return { message: 'Role deletada com sucesso', id };
+      return { message: "", id };
     } catch (error) {
       console.error(

[NoCoverage] BlockStatement
application/handlers/role/deleteRole.handler.ts:48:21
     try {
       await this.roleRepository.delete(id);
       return { message: 'Role deletada com sucesso', id };
-    } catch (error) {
-      console.error(
-        'Erro inesperado ao tentar deletar a role no banco:',
-        error,
-      );
-      throw new InternalServerErrorException(
-        `Ocorreu um erro no servidor ao tentar deletar a role. Detalhe: ${error.message}`,
-      );
-    }
+    } catch (error) {}
   }
 }
