[NoCoverage] BlockStatement
application/handlers/role/getAllRoles.handler.ts:15:36
     private readonly userRepository: Repository<Role>,
   ) {}
 
-  async execute(): Promise<Role[]> {
-    try {
-      return await this.userRepository.find();
-    } catch {
-      throw new BadRequestException('Erro ao buscar roles');
-    }
-  }
+  async execute(): Promise<Role[]> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/role/getAllRoles.handler.ts:16:9
   ) {}
 
   async execute(): Promise<Role[]> {
-    try {
-      return await this.userRepository.find();
-    } catch {
+    try {} catch {
       throw new BadRequestException('Erro ao buscar roles');
     }

[NoCoverage] BlockStatement
application/handlers/role/getAllRoles.handler.ts:18:13
   async execute(): Promise<Role[]> {
     try {
       return await this.userRepository.find();
-    } catch {
-      throw new BadRequestException('Erro ao buscar roles');
-    }
+    } catch {}
   }
 }
