[NoCoverage] BlockStatement
application/handlers/role/listSpecificRole.handler.ts:17:64
     private readonly roleRepository: Repository<Role>,
   ) {}
 
-  async execute(query: ListSpecificRoleQuery): Promise<Role[]> {
-    const id = query.id;
-
-    try {
-      return await this.roleRepository.find({
-        where: [{ id }],
-      });
-    } catch {
-      throw new BadRequestException('Erro ao buscar role');
-    }
-  }
+  async execute(query: ListSpecificRoleQuery): Promise<Role[]> {}
 }
 

[NoCoverage] BlockStatement
application/handlers/role/listSpecificRole.handler.ts:20:9
   async execute(query: ListSpecificRoleQuery): Promise<Role[]> {
     const id = query.id;
 
-    try {
-      return await this.roleRepository.find({
-        where: [{ id }],
-      });
-    } catch {
+    try {} catch {
       throw new BadRequestException('Erro ao buscar role');
     }

[NoCoverage] BlockStatement
application/handlers/role/listSpecificRole.handler.ts:24:13
       return await this.roleRepository.find({
         where: [{ id }],
       });
-    } catch {
-      throw new BadRequestException('Erro ao buscar role');
-    }
+    } catch {}
   }
 }

[NoCoverage] StringLiteral
application/handlers/role/listSpecificRole.handler.ts:25:37
         where: [{ id }],
       });
     } catch {
-      throw new BadRequestException('Erro ao buscar role');
+      throw new BadRequestException("");
     }
   }
