[NoCoverage] ObjectLiteral
application/handlers/role/updateRole.handler.ts:30:62
 
     const formattedName = name.toUpperCase();
 
-    const existingName = await this.roleRepository.findOneBy({
-      name: formattedName,
-    });
+    const existingName = await this.roleRepository.findOneBy({});
 
     if (!role) {

[NoCoverage] ConditionalExpression
application/handlers/role/updateRole.handler.ts:34:9
       name: formattedName,
     });
 
-    if (!role) {
+    if (false) {
       throw new NotFoundException('Role não encontrada');
     }

[NoCoverage] StringLiteral
application/handlers/role/updateRole.handler.ts:35:35
     });
 
     if (!role) {
-      throw new NotFoundException('Role não encontrada');
+      throw new NotFoundException("");
     }
 

[NoCoverage] ConditionalExpression
application/handlers/role/updateRole.handler.ts:38:9
       throw new NotFoundException('Role não encontrada');
     }
 
-    if (existingName) {
+    if (false) {
       throw new ConflictException('Nome já utilizado por outra role');
     }

[NoCoverage] ConditionalExpression
application/handlers/role/updateRole.handler.ts:38:9
       throw new NotFoundException('Role não encontrada');
     }
 
-    if (existingName) {
+    if (true) {
       throw new ConflictException('Nome já utilizado por outra role');
     }

[NoCoverage] ConditionalExpression
application/handlers/role/updateRole.handler.ts:42:9
       throw new ConflictException('Nome já utilizado por outra role');
     }
 
-    if (name !== undefined) {
+    if (true) {
       role.name = formattedName;
     }

[NoCoverage] BlockStatement
application/handlers/role/updateRole.handler.ts:42:29
       throw new ConflictException('Nome já utilizado por outra role');
     }
 
-    if (name !== undefined) {
-      role.name = formattedName;
-    }
+    if (name !== undefined) {}
 
     try {

[NoCoverage] BlockStatement
application/handlers/role/updateRole.handler.ts:46:9
       role.name = formattedName;
     }
 
-    try {
-      const updatedRole = await this.roleRepository.save(role);
-      return {
-        message: 'Role atualizada com sucesso',
-        role: updatedRole,
-      };
-    } catch (error) {
+    try {} catch (error) {
       console.error('Erro ao atualizar role:', error);
       throw new BadRequestException(

[NoCoverage] BlockStatement
application/handlers/role/updateRole.handler.ts:52:21
         message: 'Role atualizada com sucesso',
         role: updatedRole,
       };
-    } catch (error) {
-      console.error('Erro ao atualizar role:', error);
-      throw new BadRequestException(
-        `Erro ao atualizar role. Detalhes: ${error.message || 'Erro desconhecido'}`,
-      );
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] StringLiteral
application/handlers/role/updateRole.handler.ts:53:21
         role: updatedRole,
       };
     } catch (error) {
-      console.error('Erro ao atualizar role:', error);
+      console.error("", error);
       throw new BadRequestException(
         `Erro ao atualizar role. Detalhes: ${error.message || 'Erro desconhecido'}`,

[NoCoverage] LogicalOperator
application/handlers/role/updateRole.handler.ts:55:46
     } catch (error) {
       console.error('Erro ao atualizar role:', error);
       throw new BadRequestException(
-        `Erro ao atualizar role. Detalhes: ${error.message || 'Erro desconhecido'}`,
+        `Erro ao atualizar role. Detalhes: ${error.message && 'Erro desconhecido'}`,
       );
     }

[NoCoverage] ConditionalExpression
application/handlers/role/updateRole.handler.ts:55:46
     } catch (error) {
       console.error('Erro ao atualizar role:', error);
       throw new BadRequestException(
-        `Erro ao atualizar role. Detalhes: ${error.message || 'Erro desconhecido'}`,
+        `Erro ao atualizar role. Detalhes: ${true}`,
       );
     }
