[Killed] ObjectLiteral
application/handlers/user/createUser.handler.ts:21:62
       const saltRounds = 10;
       const { name, email, cpf, phone, addressId, password, roleId } = command;
 
-      const existingUser = await this.userRepository.findOne({
-        where: [{ email }, { cpf }],
-      });
+      const existingUser = await this.userRepository.findOne({});
 
       if (existingUser) {
killedBy: CreateUserHandler deve criar e salvar um novo usuário com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Array [
-     Object {

[Killed] ArrayDeclaration
application/handlers/user/createUser.handler.ts:22:16
       const { name, email, cpf, phone, addressId, password, roleId } = command;
 
       const existingUser = await this.userRepository.findOne({
-        where: [{ email }, { cpf }],
+        where: [],
       });
 
killedBy: CreateUserHandler deve criar e salvar um novo usuário com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Array [
-     Object {

[Killed] ConditionalExpression
application/handlers/user/createUser.handler.ts:25:11
         where: [{ email }, { cpf }],
       });
 
-      if (existingUser) {
+      if (true) {
         throw new BadRequestException(
           'Email ou CPF já estão em uso. Por favor, tente novamente com outros dados.',
killedBy: CreateUserHandler deve criar e salvar um novo usuário com sucesso
statusReason: BadRequestException: Email ou CPF já estão em uso. Por favor, tente novamente com outros dados.

[Killed] ConditionalExpression
application/handlers/user/createUser.handler.ts:25:11
         where: [{ email }, { cpf }],
       });
 
-      if (existingUser) {
+      if (false) {
         throw new BadRequestException(
           'Email ou CPF já estão em uso. Por favor, tente novamente com outros dados.',
killedBy: CreateUserHandler deve lançar uma BadRequestException se o email ou CPF já estiver em uso
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"message": "Usuário criado com sucesso", "user": {"cpf": "123.456.789-00", "email": "john.doe@example.com", "name": "John Doe"}}

[Killed] BlockStatement
application/handlers/user/createUser.handler.ts:53:21
           cpf: user.cpf,
         },
       };
-    } catch (error) {
-      throw new BadRequestException(
-        error.message || 'Erro ao criar o usuário. Por favor, tente novamente.',
-      );
-    }
+    } catch (error) {}
   }
 }
killedBy: CreateUserHandler deve lançar uma BadRequestException se o email ou CPF já estiver em uso
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] LogicalOperator
application/handlers/user/createUser.handler.ts:55:9
       };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao criar o usuário. Por favor, tente novamente.',
+        error.message && 'Erro ao criar o usuário. Por favor, tente novamente.',
       );
     }
killedBy: CreateUserHandler deve lançar uma BadRequestException se o email ou CPF já estiver em uso
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Email ou CPF já estão em uso. Por favor, tente novamente com outros dados."
Received message: "Erro ao criar o usuário. Por favor, tente novamente."

      117 |         } else {
      118 |           stryCov_9fa48("551");

[Killed] ConditionalExpression
application/handlers/user/createUser.handler.ts:55:9
       };
     } catch (error) {
       throw new BadRequestException(
-        error.message || 'Erro ao criar o usuário. Por favor, tente novamente.',
+        true,
       );
     }
killedBy: CreateUserHandler deve lançar uma BadRequestException se o email ou CPF já estiver em uso
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Email ou CPF já estão em uso. Por favor, tente novamente com outros dados."
Received message: "Bad Request Exception"

      117 |         } else {
      118 |           stryCov_9fa48("551");
