[NoCoverage] BlockStatement
commom/validators/user/cpfValidator.ts:3:62
 import { registerDecorator, ValidationOptions } from 'class-validator';
 
-export function IsCPF(validationOptions?: ValidationOptions) {
-  return function (object: any, propertyName: string) {
-    registerDecorator({
-      name: 'isCPF',
-      target: object.constructor,
-      propertyName: propertyName,
-      constraints: [],
-      options: validationOptions,
-      validator: {
-        validate(value: any) {
-          if (!value) return false;
-
-          // Função de validação do CPF real
-          return validateCPF(value);
-        },
-        defaultMessage() {
-          return 'O CPF fornecido não é válido.';
-        },
-      },
-    });
-  };
-}
+export function IsCPF(validationOptions?: ValidationOptions) {}
 
 // Função para validar CPF (com verificação dos dígitos verificadores)

[NoCoverage] BlockStatement
commom/validators/user/cpfValidator.ts:4:55
 import { registerDecorator, ValidationOptions } from 'class-validator';
 
 export function IsCPF(validationOptions?: ValidationOptions) {
-  return function (object: any, propertyName: string) {
-    registerDecorator({
-      name: 'isCPF',
-      target: object.constructor,
-      propertyName: propertyName,
-      constraints: [],
-      options: validationOptions,
-      validator: {
-        validate(value: any) {
-          if (!value) return false;
-
-          // Função de validação do CPF real
-          return validateCPF(value);
-        },
-        defaultMessage() {
-          return 'O CPF fornecido não é válido.';
-        },
-      },
-    });
-  };
+  return function (object: any, propertyName: string) {};
 }
 

[NoCoverage] BlockStatement
commom/validators/user/cpfValidator.ts:12:30
       constraints: [],
       options: validationOptions,
       validator: {
-        validate(value: any) {
-          if (!value) return false;
-
-          // Função de validação do CPF real
-          return validateCPF(value);
-        },
+        validate(value: any) {},
         defaultMessage() {
           return 'O CPF fornecido não é válido.';

[NoCoverage] BooleanLiteral
commom/validators/user/cpfValidator.ts:13:30
       options: validationOptions,
       validator: {
         validate(value: any) {
-          if (!value) return false;
+          if (!value) return true;
 
           // Função de validação do CPF real

[NoCoverage] ConditionalExpression
commom/validators/user/cpfValidator.ts:13:15
       options: validationOptions,
       validator: {
         validate(value: any) {
-          if (!value) return false;
+          if (true) return false;
 
           // Função de validação do CPF real

[NoCoverage] BlockStatement
commom/validators/user/cpfValidator.ts:18:26
           // Função de validação do CPF real
           return validateCPF(value);
         },
-        defaultMessage() {
-          return 'O CPF fornecido não é válido.';
-        },
+        defaultMessage() {},
       },
     });

[NoCoverage] Regex
commom/validators/user/cpfValidator.ts:29:21
 // Função para validar CPF (com verificação dos dígitos verificadores)
 export function validateCPF(cpf: string): boolean {
   // Remove caracteres não numéricos
-  cpf = cpf.replace(/\D/g, '');
+  cpf = cpf.replace(/\d/g, '');
 
   // Verifica se o CPF tem 11 dígitos

[NoCoverage] EqualityOperator
commom/validators/user/cpfValidator.ts:32:7
   cpf = cpf.replace(/\D/g, '');
 
   // Verifica se o CPF tem 11 dígitos
-  if (cpf.length !== 11) return false;
+  if (cpf.length === 11) return false;
 
   // Valida se todos os números são iguais (ex: 111.111.111-11)

[NoCoverage] BooleanLiteral
commom/validators/user/cpfValidator.ts:32:33
   cpf = cpf.replace(/\D/g, '');
 
   // Verifica se o CPF tem 11 dígitos
-  if (cpf.length !== 11) return false;
+  if (cpf.length !== 11) return true;
 
   // Valida se todos os números são iguais (ex: 111.111.111-11)

[NoCoverage] ConditionalExpression
commom/validators/user/cpfValidator.ts:35:7
   if (cpf.length !== 11) return false;
 
   // Valida se todos os números são iguais (ex: 111.111.111-11)
-  if (/^(\d)\1{10}$/.test(cpf)) return false;
+  if (true) return false;
 
   // Cálculo do primeiro dígito verificador

[NoCoverage] BooleanLiteral
commom/validators/user/cpfValidator.ts:35:40
   if (cpf.length !== 11) return false;
 
   // Valida se todos os números são iguais (ex: 111.111.111-11)
-  if (/^(\d)\1{10}$/.test(cpf)) return false;
+  if (/^(\d)\1{10}$/.test(cpf)) return true;
 
   // Cálculo do primeiro dígito verificador

[NoCoverage] BlockStatement
commom/validators/user/cpfValidator.ts:39:31
 
   // Cálculo do primeiro dígito verificador
   let sum = 0;
-  for (let i = 0; i < 9; i++) {
-    sum += parseInt(cpf.charAt(i)) * (10 - i);
-  }
+  for (let i = 0; i < 9; i++) {}
   let firstCheckDigit = 11 - (sum % 11);
   if (firstCheckDigit === 10 || firstCheckDigit === 11) firstCheckDigit = 0;

[NoCoverage] ConditionalExpression
commom/validators/user/cpfValidator.ts:39:19
 
   // Cálculo do primeiro dígito verificador
   let sum = 0;
-  for (let i = 0; i < 9; i++) {
+  for (let i = 0; false; i++) {
     sum += parseInt(cpf.charAt(i)) * (10 - i);
   }

[NoCoverage] ArithmeticOperator
commom/validators/user/cpfValidator.ts:40:39
   // Cálculo do primeiro dígito verificador
   let sum = 0;
   for (let i = 0; i < 9; i++) {
-    sum += parseInt(cpf.charAt(i)) * (10 - i);
+    sum += parseInt(cpf.charAt(i)) * (10 + i);
   }
   let firstCheckDigit = 11 - (sum % 11);

[NoCoverage] MethodExpression
commom/validators/user/cpfValidator.ts:40:21
   // Cálculo do primeiro dígito verificador
   let sum = 0;
   for (let i = 0; i < 9; i++) {
-    sum += parseInt(cpf.charAt(i)) * (10 - i);
+    sum += parseInt(cpf) * (10 - i);
   }
   let firstCheckDigit = 11 - (sum % 11);

[NoCoverage] ArithmeticOperator
commom/validators/user/cpfValidator.ts:42:25
   for (let i = 0; i < 9; i++) {
     sum += parseInt(cpf.charAt(i)) * (10 - i);
   }
-  let firstCheckDigit = 11 - (sum % 11);
+  let firstCheckDigit = 11 + sum % 11;
   if (firstCheckDigit === 10 || firstCheckDigit === 11) firstCheckDigit = 0;
   if (firstCheckDigit !== parseInt(cpf.charAt(9))) return false;

[NoCoverage] ArithmeticOperator
commom/validators/user/cpfValidator.ts:42:31
   for (let i = 0; i < 9; i++) {
     sum += parseInt(cpf.charAt(i)) * (10 - i);
   }
-  let firstCheckDigit = 11 - (sum % 11);
+  let firstCheckDigit = 11 - (sum * 11);
   if (firstCheckDigit === 10 || firstCheckDigit === 11) firstCheckDigit = 0;
   if (firstCheckDigit !== parseInt(cpf.charAt(9))) return false;

[NoCoverage] ConditionalExpression
commom/validators/user/cpfValidator.ts:43:7
     sum += parseInt(cpf.charAt(i)) * (10 - i);
   }
   let firstCheckDigit = 11 - (sum % 11);
-  if (firstCheckDigit === 10 || firstCheckDigit === 11) firstCheckDigit = 0;
+  if (true) firstCheckDigit = 0;
   if (firstCheckDigit !== parseInt(cpf.charAt(9))) return false;
 

[NoCoverage] LogicalOperator
commom/validators/user/cpfValidator.ts:43:7
     sum += parseInt(cpf.charAt(i)) * (10 - i);
   }
   let firstCheckDigit = 11 - (sum % 11);
-  if (firstCheckDigit === 10 || firstCheckDigit === 11) firstCheckDigit = 0;
+  if (firstCheckDigit === 10 && firstCheckDigit === 11) firstCheckDigit = 0;
   if (firstCheckDigit !== parseInt(cpf.charAt(9))) return false;
 

[NoCoverage] ConditionalExpression
commom/validators/user/cpfValidator.ts:44:7
   }
   let firstCheckDigit = 11 - (sum % 11);
   if (firstCheckDigit === 10 || firstCheckDigit === 11) firstCheckDigit = 0;
-  if (firstCheckDigit !== parseInt(cpf.charAt(9))) return false;
+  if (false) return false;
 
   // Cálculo do segundo dígito verificador

[NoCoverage] EqualityOperator
commom/validators/user/cpfValidator.ts:44:7
   }
   let firstCheckDigit = 11 - (sum % 11);
   if (firstCheckDigit === 10 || firstCheckDigit === 11) firstCheckDigit = 0;
-  if (firstCheckDigit !== parseInt(cpf.charAt(9))) return false;
+  if (firstCheckDigit === parseInt(cpf.charAt(9))) return false;
 
   // Cálculo do segundo dígito verificador

[NoCoverage] EqualityOperator
commom/validators/user/cpfValidator.ts:48:19
 
   // Cálculo do segundo dígito verificador
   sum = 0;
-  for (let i = 0; i < 10; i++) {
+  for (let i = 0; i <= 10; i++) {
     sum += parseInt(cpf.charAt(i)) * (11 - i);
   }

[NoCoverage] ConditionalExpression
commom/validators/user/cpfValidator.ts:48:19
 
   // Cálculo do segundo dígito verificador
   sum = 0;
-  for (let i = 0; i < 10; i++) {
+  for (let i = 0; false; i++) {
     sum += parseInt(cpf.charAt(i)) * (11 - i);
   }

[NoCoverage] AssignmentOperator
commom/validators/user/cpfValidator.ts:49:5
   // Cálculo do segundo dígito verificador
   sum = 0;
   for (let i = 0; i < 10; i++) {
-    sum += parseInt(cpf.charAt(i)) * (11 - i);
+    sum -= parseInt(cpf.charAt(i)) * (11 - i);
   }
   let secondCheckDigit = 11 - (sum % 11);

[NoCoverage] ArithmeticOperator
commom/validators/user/cpfValidator.ts:49:39
   // Cálculo do segundo dígito verificador
   sum = 0;
   for (let i = 0; i < 10; i++) {
-    sum += parseInt(cpf.charAt(i)) * (11 - i);
+    sum += parseInt(cpf.charAt(i)) * (11 + i);
   }
   let secondCheckDigit = 11 - (sum % 11);

[NoCoverage] ArithmeticOperator
commom/validators/user/cpfValidator.ts:51:32
   for (let i = 0; i < 10; i++) {
     sum += parseInt(cpf.charAt(i)) * (11 - i);
   }
-  let secondCheckDigit = 11 - (sum % 11);
+  let secondCheckDigit = 11 - (sum * 11);
   if (secondCheckDigit === 10 || secondCheckDigit === 11) secondCheckDigit = 0;
   if (secondCheckDigit !== parseInt(cpf.charAt(10))) return false;

[NoCoverage] ArithmeticOperator
commom/validators/user/cpfValidator.ts:51:26
   for (let i = 0; i < 10; i++) {
     sum += parseInt(cpf.charAt(i)) * (11 - i);
   }
-  let secondCheckDigit = 11 - (sum % 11);
+  let secondCheckDigit = 11 + sum % 11;
   if (secondCheckDigit === 10 || secondCheckDigit === 11) secondCheckDigit = 0;
   if (secondCheckDigit !== parseInt(cpf.charAt(10))) return false;

[NoCoverage] ConditionalExpression
commom/validators/user/cpfValidator.ts:52:7
     sum += parseInt(cpf.charAt(i)) * (11 - i);
   }
   let secondCheckDigit = 11 - (sum % 11);
-  if (secondCheckDigit === 10 || secondCheckDigit === 11) secondCheckDigit = 0;
+  if (true) secondCheckDigit = 0;
   if (secondCheckDigit !== parseInt(cpf.charAt(10))) return false;
 

[NoCoverage] EqualityOperator
commom/validators/user/cpfValidator.ts:52:7
     sum += parseInt(cpf.charAt(i)) * (11 - i);
   }
   let secondCheckDigit = 11 - (sum % 11);
-  if (secondCheckDigit === 10 || secondCheckDigit === 11) secondCheckDigit = 0;
+  if (secondCheckDigit !== 10 || secondCheckDigit === 11) secondCheckDigit = 0;
   if (secondCheckDigit !== parseInt(cpf.charAt(10))) return false;
 

[NoCoverage] ConditionalExpression
commom/validators/user/cpfValidator.ts:53:7
   }
   let secondCheckDigit = 11 - (sum % 11);
   if (secondCheckDigit === 10 || secondCheckDigit === 11) secondCheckDigit = 0;
-  if (secondCheckDigit !== parseInt(cpf.charAt(10))) return false;
+  if (true) return false;
 
   return true;

[NoCoverage] EqualityOperator
commom/validators/user/cpfValidator.ts:53:7
   }
   let secondCheckDigit = 11 - (sum % 11);
   if (secondCheckDigit === 10 || secondCheckDigit === 11) secondCheckDigit = 0;
-  if (secondCheckDigit !== parseInt(cpf.charAt(10))) return false;
+  if (secondCheckDigit === parseInt(cpf.charAt(10))) return false;
 
   return true;
