[Killed] BlockStatement
application/commands/user/deleteUser.command.ts:7:30
   @IsEmail()
   email: string;
 
-  constructor(email: string) {
-    this.email = email;
-  }
+  constructor(email: string) {}
 }
 
killedBy: DeleteUserHandler execute ✅ deve retornar um objeto confirmando o delete de um usuário com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "email": "john.doe@example.com",
+   "email": undefined,
