[Killed] BlockStatement
application/handlers/user/deleteUser.handler.ts:15:59
     private readonly userRepository: Repository<User>,
   ) {}
 
-  async execute(command: DeleteUserCommand): Promise<any> {
-    const email = command.email;
-
-    try {
-      const user = await this.userRepository.findOneBy({ email });
-
-      if (!user) {
-        throw new NotFoundException('Usuário não encontrado');
-      }
-
-      await this.userRepository.delete({ email });
-
-      return { message: 'Usuário deletado com sucesso', email };
-    } catch (error) {
-      if (error instanceof NotFoundException) {
-        throw error;
-      }
-      throw new BadRequestException('Erro ao deletar usuário');
-    }
-  }
+  async execute(command: DeleteUserCommand): Promise<any> {}
 }
 
killedBy: DeleteUserHandler execute ✅ deve retornar um objeto confirmando o delete de um usuário com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "john.doe@example.com", "message": "Usuário deletado com sucesso"}
Received: undefined

[Killed] BlockStatement
application/handlers/user/deleteUser.handler.ts:18:9
   async execute(command: DeleteUserCommand): Promise<any> {
     const email = command.email;
 
-    try {
-      const user = await this.userRepository.findOneBy({ email });
-
-      if (!user) {
-        throw new NotFoundException('Usuário não encontrado');
-      }
-
-      await this.userRepository.delete({ email });
-
-      return { message: 'Usuário deletado com sucesso', email };
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof NotFoundException) {
         throw error;
killedBy: DeleteUserHandler execute ✅ deve retornar um objeto confirmando o delete de um usuário com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "john.doe@example.com", "message": "Usuário deletado com sucesso"}
Received: undefined

[Killed] ConditionalExpression
application/handlers/user/deleteUser.handler.ts:21:11
     try {
       const user = await this.userRepository.findOneBy({ email });
 
-      if (!user) {
+      if (true) {
         throw new NotFoundException('Usuário não encontrado');
       }
killedBy: DeleteUserHandler execute ✅ deve retornar um objeto confirmando o delete de um usuário com sucesso
statusReason: NotFoundException: Usuário não encontrado

[Killed] StringLiteral
application/handlers/user/deleteUser.handler.ts:22:37
       const user = await this.userRepository.findOneBy({ email });
 
       if (!user) {
-        throw new NotFoundException('Usuário não encontrado');
+        throw new NotFoundException("");
       }
 
killedBy: DeleteUserHandler execute ❌ deve lançar NotFoundException se o usuário não for encontrado
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Usuário não encontrado"
Received message: "Not Found"

      75 |             } else {
      76 |               stryCov_9fa48("562");
    > 77 |               throw new NotFoundException(stryMutAct_9fa48("563") ? "" : (stryCov_9fa48("563"), 'Usuário não encontrado'));

[Killed] StringLiteral
application/handlers/user/deleteUser.handler.ts:27:25
 
       await this.userRepository.delete({ email });
 
-      return { message: 'Usuário deletado com sucesso', email };
+      return { message: "", email };
     } catch (error) {
       if (error instanceof NotFoundException) {
killedBy: DeleteUserHandler execute ✅ deve retornar um objeto confirmando o delete de um usuário com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "email": "john.doe@example.com",
-   "message": "Usuário deletado com sucesso",

[Killed] BlockStatement
application/handlers/user/deleteUser.handler.ts:28:21
       await this.userRepository.delete({ email });
 
       return { message: 'Usuário deletado com sucesso', email };
-    } catch (error) {
-      if (error instanceof NotFoundException) {
-        throw error;
-      }
-      throw new BadRequestException('Erro ao deletar usuário');
-    }
+    } catch (error) {}
   }
 }
killedBy: DeleteUserHandler execute ❌ deve lançar NotFoundException se o usuário não for encontrado
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
application/handlers/user/deleteUser.handler.ts:29:11
 
       return { message: 'Usuário deletado com sucesso', email };
     } catch (error) {
-      if (error instanceof NotFoundException) {
+      if (true) {
         throw error;
       }
killedBy: DeleteUserHandler execute ❌ deve lançar BadRequestExecption se o usuário não for encontrado
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Erro ao deletar usuário"
Received message: "Database error"

      88 |
      89 |       mockUserRepository.findOneBy.mockResolvedValue(mockUser);
    > 90 |       mockUserRepository.delete.mockRejectedValue(new Error('Database error'));

[Killed] StringLiteral
application/handlers/user/deleteUser.handler.ts:32:37
       if (error instanceof NotFoundException) {
         throw error;
       }
-      throw new BadRequestException('Erro ao deletar usuário');
+      throw new BadRequestException("");
     }
   }
killedBy: DeleteUserHandler execute ❌ deve lançar BadRequestExecption se o usuário não for encontrado
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Erro ao deletar usuário"
Received message: "Bad Request"

       99 |             }
      100 |           }
    > 101 |           throw new BadRequestException(stryMutAct_9fa48("571") ? "" : (stryCov_9fa48("571"), 'Erro ao deletar usuário'));
