[Killed] BlockStatement
application/handlers/user/getAllUsers.handler.ts:15:60
     private readonly userRepository: Repository<User>,
   ) {}
 
-  async execute(_query: GetAllUsersQuery): Promise<User[]> {
-    try {
-      return await this.userRepository.find({
-        select: ['id', 'name', 'email', 'phone', 'isActive'],
-        relations: ['address', 'role'],
-      });
-    } catch (error) {
-      throw new BadRequestException('Erro ao buscar usuários');
-    }
-  }
+  async execute(_query: GetAllUsersQuery): Promise<User[]> {}
 }
 
killedBy: GetAllUsersHandler execute ✅ deve retornar um array de usuários com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "joao.silva@example.com", "isActive": true, "name": "João da Silva", "phone": "11999998888"}, {"email": "maria.oliveira@example.com", "isActive": true, "name": "Maria Oliveira", "phone": "21888887777"}]
Received: undefined

[Killed] BlockStatement
application/handlers/user/getAllUsers.handler.ts:16:9
   ) {}
 
   async execute(_query: GetAllUsersQuery): Promise<User[]> {
-    try {
-      return await this.userRepository.find({
-        select: ['id', 'name', 'email', 'phone', 'isActive'],
-        relations: ['address', 'role'],
-      });
-    } catch (error) {
+    try {} catch (error) {
       throw new BadRequestException('Erro ao buscar usuários');
     }
killedBy: GetAllUsersHandler execute ✅ deve retornar um array de usuários com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "joao.silva@example.com", "isActive": true, "name": "João da Silva", "phone": "11999998888"}, {"email": "maria.oliveira@example.com", "isActive": true, "name": "Maria Oliveira", "phone": "21888887777"}]
Received: undefined

[Killed] StringLiteral
application/handlers/user/getAllUsers.handler.ts:18:50
   async execute(_query: GetAllUsersQuery): Promise<User[]> {
     try {
       return await this.userRepository.find({
-        select: ['id', 'name', 'email', 'phone', 'isActive'],
+        select: ['id', 'name', 'email', 'phone', ""],
         relations: ['address', 'role'],
       });
killedBy: GetAllUsersHandler execute ✅ deve retornar um array de usuários com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -6,8 +6,8 @@
    "select": Array [
      "id",

[Killed] StringLiteral
application/handlers/user/getAllUsers.handler.ts:18:24
   async execute(_query: GetAllUsersQuery): Promise<User[]> {
     try {
       return await this.userRepository.find({
-        select: ['id', 'name', 'email', 'phone', 'isActive'],
+        select: ['id', "", 'email', 'phone', 'isActive'],
         relations: ['address', 'role'],
       });
killedBy: GetAllUsersHandler execute ✅ deve retornar um array de usuários com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,11 +3,11 @@
      "address",
      "role",

[Killed] ArrayDeclaration
application/handlers/user/getAllUsers.handler.ts:19:20
     try {
       return await this.userRepository.find({
         select: ['id', 'name', 'email', 'phone', 'isActive'],
-        relations: ['address', 'role'],
+        relations: [],
       });
     } catch (error) {
killedBy: GetAllUsersHandler execute ✅ deve retornar um array de usuários com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,7 @@
  Object {
-   "relations": Array [

[Killed] BlockStatement
application/handlers/user/getAllUsers.handler.ts:21:21
         select: ['id', 'name', 'email', 'phone', 'isActive'],
         relations: ['address', 'role'],
       });
-    } catch (error) {
-      throw new BadRequestException('Erro ao buscar usuários');
-    }
+    } catch (error) {}
   }
 }
killedBy: GetAllUsersHandler execute ❌ deve lançar uma BadRequestException se o repositório falhar
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
application/handlers/user/getAllUsers.handler.ts:22:37
         relations: ['address', 'role'],
       });
     } catch (error) {
-      throw new BadRequestException('Erro ao buscar usuários');
+      throw new BadRequestException("");
     }
   }
killedBy: GetAllUsersHandler execute ❌ deve lançar uma BadRequestException se o repositório falhar
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Erro ao buscar usuários"
Received message:   "Bad Request"

      76 |         } else {
      77 |           stryCov_9fa48("584");
    > 78 |           throw new BadRequestException(stryMutAct_9fa48("585") ? "" : (stryCov_9fa48("585"), 'Erro ao buscar usuários'));
