[Killed] BlockStatement
application/handlers/user/listSpecificUser.handler.ts:17:64
     private readonly userRepository: Repository<User>,
   ) {}
 
-  async execute(query: ListSpecificUserQuery): Promise<User[]> {
-    const email = query.email;
-
-    try {
-      return await this.userRepository.find({
-        select: ['name', 'email', 'phone', 'isActive'],
-        relations: ['address', 'role'],
-        where: [{ email }],
-      });
-    } catch {
-      throw new BadRequestException('Erro ao buscar usuários');
-    }
-  }
+  async execute(query: ListSpecificUserQuery): Promise<User[]> {}
 }
 
killedBy: ListSpecificUserHandler execute ✅ deve retornar um array com um usuário com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "joao.silva@example.com", "isActive": true, "name": "João da Silva", "phone": "11999998888"}, {"email": "maria.oliveira@example.com", "isActive": true, "name": "Maria Oliveira", "phone": "21888887777"}]
Received: undefined

[Killed] BlockStatement
application/handlers/user/listSpecificUser.handler.ts:20:9
   async execute(query: ListSpecificUserQuery): Promise<User[]> {
     const email = query.email;
 
-    try {
-      return await this.userRepository.find({
-        select: ['name', 'email', 'phone', 'isActive'],
-        relations: ['address', 'role'],
-        where: [{ email }],
-      });
-    } catch {
+    try {} catch {
       throw new BadRequestException('Erro ao buscar usuários');
     }
killedBy: ListSpecificUserHandler execute ✅ deve retornar um array com um usuário com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "joao.silva@example.com", "isActive": true, "name": "João da Silva", "phone": "11999998888"}, {"email": "maria.oliveira@example.com", "isActive": true, "name": "Maria Oliveira", "phone": "21888887777"}]
Received: undefined

[Killed] ObjectLiteral
application/handlers/user/listSpecificUser.handler.ts:21:45
     const email = query.email;
 
     try {
-      return await this.userRepository.find({
-        select: ['name', 'email', 'phone', 'isActive'],
-        relations: ['address', 'role'],
-        where: [{ email }],
-      });
+      return await this.userRepository.find({});
     } catch {
       throw new BadRequestException('Erro ao buscar usuários');
killedBy: ListSpecificUserHandler execute ✅ deve retornar um array com um usuário com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "relations": Array [
-     "address",

[Killed] ArrayDeclaration
application/handlers/user/listSpecificUser.handler.ts:23:20
     try {
       return await this.userRepository.find({
         select: ['name', 'email', 'phone', 'isActive'],
-        relations: ['address', 'role'],
+        relations: [],
         where: [{ email }],
       });
killedBy: ListSpecificUserHandler execute ✅ deve retornar um array com um usuário com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,7 @@
  Object {
-   "relations": Array [

[Killed] BlockStatement
application/handlers/user/listSpecificUser.handler.ts:26:13
         relations: ['address', 'role'],
         where: [{ email }],
       });
-    } catch {
-      throw new BadRequestException('Erro ao buscar usuários');
-    }
+    } catch {}
   }
 }
killedBy: ListSpecificUserHandler execute ❌ deve lançar uma BadRequestException se o repositório falhar
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
