[Killed] BlockStatement
application/handlers/user/updateUser.handler.ts:15:59
     private readonly userRepository: Repository<User>,
   ) {}
 
-  async execute(command: UpdateUserCommand): Promise<any> {
-    const { email, updateData } = command;
-
-    const user = await this.userRepository.findOneBy({ email });
-
-    if (!user) {
-      throw new NotFoundException('Usuário não encontrado');
-    }
-
-    Object.assign(user, updateData);
-
-    try {
-      await this.userRepository.save(user);
-      return { message: 'Usuário atualizado com sucesso', user };
-    } catch (error) {
-      throw new BadRequestException('Erro ao atualizar usuário');
-    }
-  }
+  async execute(command: UpdateUserCommand): Promise<any> {}
 }
 
killedBy: UpdateUserHandler execute ✅ deve retornar um objeto confirmando o update de um usuário com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Usuário atualizado com sucesso", "user": {"email": "john1.doe@example.com", "isActive": true, "name": "Lucas Dogo", "phone": "11999998888"}}
Received: undefined

[Killed] ObjectLiteral
application/handlers/user/updateUser.handler.ts:18:54
   async execute(command: UpdateUserCommand): Promise<any> {
     const { email, updateData } = command;
 
-    const user = await this.userRepository.findOneBy({ email });
+    const user = await this.userRepository.findOneBy({});
 
     if (!user) {
killedBy: UpdateUserHandler execute ✅ deve retornar um objeto confirmando o update de um usuário com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "john.doe@example.com",
- }

[Killed] ConditionalExpression
application/handlers/user/updateUser.handler.ts:20:9
 
     const user = await this.userRepository.findOneBy({ email });
 
-    if (!user) {
+    if (false) {
       throw new NotFoundException('Usuário não encontrado');
     }
killedBy: UpdateUserHandler execute ❌ deve lançar NotFoundException se o usuário não for encontrado
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Usuário não encontrado"
Received message: "Cannot convert undefined or null to object"

      76 |         }
      77 |       }
    > 78 |       Object.assign(user, updateData);

[Killed] BlockStatement
application/handlers/user/updateUser.handler.ts:26:9
 
     Object.assign(user, updateData);
 
-    try {
-      await this.userRepository.save(user);
-      return { message: 'Usuário atualizado com sucesso', user };
-    } catch (error) {
+    try {} catch (error) {
       throw new BadRequestException('Erro ao atualizar usuário');
     }
killedBy: UpdateUserHandler execute ✅ deve retornar um objeto confirmando o update de um usuário com sucesso
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Usuário atualizado com sucesso", "user": {"email": "john1.doe@example.com", "isActive": true, "name": "Lucas Dogo", "phone": "11999998888"}}
Received: undefined

[Killed] BlockStatement
application/handlers/user/updateUser.handler.ts:29:21
     try {
       await this.userRepository.save(user);
       return { message: 'Usuário atualizado com sucesso', user };
-    } catch (error) {
-      throw new BadRequestException('Erro ao atualizar usuário');
-    }
+    } catch (error) {}
   }
 }
killedBy: UpdateUserHandler execute ❌ deve lançar BadRequestExecption se o usuário não for encontrado
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
